{
    "angular": {
        "title": "Angular",
        "image": "../img/angular.png",
        "description": "<strong>Angular</strong> est un framework de développement open-source pour la création d'applications web, principalement des applications monopages (SPA). Développé par <strong>Google</strong>, il utilise TypeScript pour offrir une architecture robuste et scalable.",
        "details": "Angular se distingue par son approche basée sur les composants, permettant aux développeurs de créer des applications modulaires et réutilisables. Il inclut également un ensemble de bibliothèques bien intégrées pour le routage, la gestion des formulaires, la communication avec des API, et bien plus encore.",
        "usage": "Ce framework est particulièrement adapté aux projets d'envergure, offrant une documentation complète et un écosystème riche qui facilite la collaboration entre les équipes de développement. Angular est reconnu pour sa capacité à gérer des applications complexes tout en maintenant des performances élevées."
    },
    "css": {
        "title": "CSS",
        "image": "../img/css.png",
        "description": "<strong>CSS</strong> (Cascading Style Sheets) est un langage de style utilisé pour décrire la présentation d'un document écrit en HTML ou XML.",
        "details": "Il a été créé en <strong>1996</strong> par <strong>Håkon Wium Lie</strong> et est maintenant un standard du W3C (World Wide Web Consortium).",
        "usage": "CSS permet de contrôler l'apparence et la mise en page des éléments sur une page web, y compris la couleur, les polices, les marges, les espacements, et bien plus encore. Il permet également de créer des mises en page réactives qui s'adaptent à différentes tailles d'écran."
    },
    "docker": {
        "title": "Docker",
        "image": "../img/docker.png",
        "description": "<strong>Docker</strong> est une plateforme open-source qui automatise le déploiement d'applications à l'intérieur de conteneurs.",
        "details": "Créé en <strong>2013</strong>, Docker permet aux développeurs d'emballer des applications et toutes leurs dépendances dans un conteneur léger et portable.",
        "usage": "Les conteneurs Docker sont isolés les uns des autres et du système d'exploitation hôte, ce qui garantit que les applications s'exécutent de manière cohérente, peu importe l'environnement. Cela simplifie le processus de développement, de test et de déploiement, en rendant les applications plus faciles à gérer et à déployer."
    },
    "git": {
        "title": "Git",
        "image": "../img/git.png",
        "description": "<strong>Git</strong> est un système de contrôle de version distribué open-source, créé en <strong>2005</strong> par <strong>Linus Torvalds</strong>, le créateur de Linux.",
        "details": "Conçu pour gérer tout type de projet, Git permet de suivre les modifications du code source de manière efficace et de coordonner le travail des développeurs.",
        "usage": "Git se distingue par sa capacité à gérer les versions de manière distribuée, permettant à chaque développeur de cloner le dépôt complet, de travailler en local et de fusionner les changements de manière fluide. Cette architecture favorise une collaboration plus fluide et une gestion efficace des branches, facilitant ainsi le développement parallèle et la gestion des versions."
    },
    "html": {
        "title": "HTML",
        "image": "../img/html.png",
        "description": "<strong>HTML</strong> (HyperText Markup Language) est le langage standard utilisé pour créer des pages web. Développé à l'origine par <strong>Tim Berners-Lee</strong> en <strong>1991</strong>, HTML permet de structurer le contenu sur le web en utilisant des balises pour définir des éléments tels que des titres, des paragraphes, des images et des liens.",
        "details": "HTML se distingue par sa simplicité et sa flexibilité, offrant aux développeurs la possibilité de créer des documents riches et interactifs. En utilisant des balises, il est possible d'organiser le contenu de manière hiérarchique, ce qui facilite la navigation et l'accessibilité. HTML est souvent utilisé en conjonction avec CSS (Cascading Style Sheets) pour le style et JavaScript pour l'interactivité, formant ainsi la base des technologies web modernes.",
        "usage": "Utilisé par des millions de développeurs et soutenu par une vaste communauté, HTML est reconnu pour sa compatibilité avec tous les navigateurs web et sa capacité à s'adapter à différents appareils, y compris les ordinateurs de bureau, les tablettes et les smartphones. La documentation et les ressources disponibles en ligne permettent aux utilisateurs, qu'ils soient débutants ou expérimentés, de maîtriser rapidement ce langage essentiel pour le développement web."
    },
    "javascript": {
        "title": "JavaScript",
        "image": "../img/javascript.png",
        "description": "<strong>JavaScript</strong> est un langage de programmation dynamique et orienté objet, principalement utilisé pour le développement web.",
        "details": "Il a été créé en <strong>1995</strong> par <strong>Brendan Eich</strong> et est désormais un standard de facto pour le développement côté client.",
        "usage": "JavaScript permet d'ajouter de l'interactivité aux pages web, de manipuler le Document Object Model (DOM) et d'effectuer des requêtes asynchrones grâce à des technologies comme AJAX. Ce langage est également utilisé côté serveur avec des environnements comme Node.js."
    },
    "less": {
        "title": "Less",
        "image": "../img/less.png",
        "description": "<strong>LESS</strong> est un préprocesseur CSS qui permet d'écrire des feuilles de style de manière plus dynamique et maintenable.",
        "details": "Créé en <strong>2009</strong> par <strong>Alexis Sellier</strong>, LESS ajoute des fonctionnalités telles que les variables, les mixins, les fonctions et les opérations, facilitant ainsi le développement CSS.",
        "usage": "LESS se distingue par sa capacité à rendre le CSS plus modulaire et réutilisable. Grâce à l'utilisation de variables, les développeurs peuvent stocker les couleurs, les tailles et les polices, ce qui simplifie la gestion des styles à travers un projet. Les mixins permettent également d'inclure des groupes de propriétés CSS dans d'autres sélecteurs, réduisant ainsi la redondance et améliorant la lisibilité du code."
    },
    "mysql": {
        "title": "SQL",
        "image": "../img/mysql.png",
        "description": "<strong>SQL</strong> (Structured Query Language) est un langage standard utilisé pour la gestion et la manipulation des bases de données relationnelles.",
        "details": "Il a été développé dans les années <strong>1970</strong> par <strong>IBM</strong> et est maintenant utilisé par de nombreux systèmes de gestion de bases de données, tels que MySQL, PostgreSQL, Oracle, et Microsoft SQL Server.",
        "usage": "SQL permet aux utilisateurs de créer, lire, mettre à jour et supprimer des données dans une base de données. Il fournit des commandes puissantes pour interroger et manipuler les données, ce qui en fait un outil essentiel pour les développeurs et les analystes de données."
    },
    "php": {
        "title": "PHP",
        "image": "../img/php.png",
        "description": "<strong>PHP</strong> (Hypertext Preprocessor) est un langage de script open-source, principalement utilisé pour le développement web.",
        "details": "Créé en <strong>1995</strong> par <strong>Rasmus Lerdorf</strong>, PHP est conçu pour permettre aux développeurs de créer des pages web dynamiques et interactives.",
        "usage": "PHP est un langage côté serveur, ce qui signifie qu'il s'exécute sur le serveur et génère du HTML qui est ensuite envoyé au navigateur de l'utilisateur. Cela permet de créer des applications web robustes qui peuvent interagir avec des bases de données, gérer des sessions utilisateur, et bien plus encore."
    },
    "python": {
        "title": "Python",
        "image": "../img/python.png",
        "description": "<strong>Python</strong> est un langage de programmation interprété, polyvalent et open-source, créé par <strong>Guido van Rossum</strong> et publié pour la première fois en <strong>1991</strong>. Il est connu pour sa syntaxe claire et lisible, ce qui en fait un excellent choix pour les débutants ainsi que pour les développeurs expérimentés.",
        "details": "Python est utilisé dans une variété de domaines, y compris le développement web, l'analyse de données, l'intelligence artificielle, l'automatisation, et bien plus encore. Sa vaste bibliothèque standard et ses nombreux frameworks, tels que Django et Flask, facilitent le développement rapide d'applications.",
        "usage": "La communauté Python est très active et offre une multitude de ressources, de bibliothèques tierces et de documentation, ce qui permet aux développeurs de tirer le meilleur parti du langage. Python est également apprécié pour sa compatibilité avec d'autres langages et technologies."
    },
    "symfony": {
        "title": "Symfony (v. 6.4)",
        "image": "../img/symfony.png",
        "description": "<strong>Symfony</strong> est un framework open-source pour le développement d'applications web, écrit en PHP.",
        "details": "Créé en <strong>2005</strong> par <strong>Fabien Potencier</strong> et développé par <strong>SensioLabs</strong>, il est conçu pour simplifier et accélérer le développement d'applications web robustes et flexibles.",
        "usage": "Utilisé par des milliers de développeurs et de grandes entreprises à travers le monde, Symfony est reconnu pour ses performances élevées."
    },
    "typescript": {
        "title": "TypeScript",
        "image": "../img/typescript.png",
        "description": "<strong>TypeScript</strong> est un langage de programmation développé par <strong>Microsoft</strong> et publié en <strong>2012</strong>. Il s'agit d'un sur-ensemble typé de JavaScript qui compile en JavaScript pur, permettant ainsi d'ajouter des fonctionnalités de typage statique au langage.",
        "details": "TypeScript est conçu pour améliorer la productivité lors du développement d'applications complexes. Il offre des fonctionnalités telles que les types, les interfaces, et la programmation orientée objet, ce qui permet de créer des applications plus robustes et maintenables.",
        "usage": "En tant que sur-ensemble de JavaScript, tout code JavaScript valide est également un code TypeScript valide. Cela facilite l'adoption progressive de TypeScript dans des projets existants. De plus, TypeScript fournit des outils de développement avancés, tels que l'auto-complétion et la vérification de types, qui améliorent l'expérience de codage."
    }
}