{
    "sections": [
        {
            "title": "Les IDE",
            "items": [
                {
                    "title": "Qu'est-ce qu'un environnement de développement intégré (IDE) ?",
                    "commands": [
                        {
                            "label": "Un [strong]environnement de développement intégré (IDE)[/strong] est un logiciel qui fournit des outils complets pour le développement de logiciels. Il combine généralement un [strong]éditeur de code[/strong], un [strong]compilateur[/strong] ou un [strong]interpréteur[/strong], un [strong]débogueur[/strong], et des [strong]outils de gestion de projet[/strong]. Les IDE facilitent le processus de développement en offrant des fonctionnalités telles que la coloration syntaxique, l'autocomplétion, la gestion de versions, et l'intégration avec des systèmes de contrôle de version comme Git.",
                            "code": ""
                        }
                    ]
                },
                {
                    "title": "Citez des IDE couramment utilisés ?",
                    "commands": [
                        {
                            "label": [
                                "On peut citer plusieurs IDE.",
                                "- [strong]Jet Brains[/strong] : C'est une suite d'applications. IntelliJ IDEA est utilisé notamment pour les projets Java. WebStorm est dédié au développement JavaScript et TypeScript, offrant des outils avancés pour le développement d'applications web. PyCharm est dédié au développement Python, offrant des outils de débogage, de test et de gestion de versions intégrés. PHPStorm est fait pour le développement PHP.",
                                "- [strong]Visual Studio Code[/strong] : Éditeur de code léger et extensible, idéal pour le développement web et le support de plusieurs langages.",
                                "- [strong]Eclipse[/strong] : IDE open-source principalement utilisé pour le développement Java, mais extensible à d'autres langages via des plugins.",
                                "- [strong]NetBeans[/strong] : IDE open-source pour le développement Java, PHP et HTML5, avec des outils de gestion de projet intégrés.",
                                "- [strong]Atom[/strong] : Éditeur de texte hackable, idéal pour le développement web et extensible avec de nombreux packages."
                            ]
                        }
                    ]
                },
                {
                    "title": "Quelles sont les principales fonctionnalités dans un IDE ?",
                    "commands": [
                        {
                            "label": [
                                "Les principales fonctionnalités à rechercher dans un IDE pour le développement web incluent...",
                                "- [strong]Complétion de code[/strong] : Aide à écrire du code plus rapidement en suggérant des complétions.",
                                "- [strong]Débogage intégré[/strong] : Permet de tester et de déboguer le code directement dans l'IDE.",
                                "- [strong]Contrôle de version[/strong] : Intégration avec des systèmes comme Git pour gérer les versions du code.",
                                "- [strong]Support multi-langage[/strong] : Capacité à travailler avec plusieurs langages de programmation (HTML, CSS, JavaScript, etc.).",
                                "- [strong]Outils de test[/strong] : Intégration d'outils de tests unitaires et fonctionnels pour assurer la qualité du code.",
                                "- [strong]Personnalisation et extensions[/strong] : Possibilité d'ajouter des plugins ou des extensions pour étendre les fonctionnalités de l'IDE.",
                                "- [strong]Interface utilisateur intuitive[/strong] : Une interface facile à utiliser qui améliore l'expérience de développement."
                            ]
                        }
                    ]
                },
                {
                    "title": "Quelles extensions pouvez-vous utiliser dans VSC ?",
                    "commands": [
                        {
                            "label": [
                                "Voici quelques plugins et extensions recommandés.",
                                "- [strong]Prettier[/strong] est un formateur de code qui assure une mise en forme cohérente du code.",
                                "- [strong]ESLint[/strong] est linter pour JavaScript qui aide à identifier et à corriger les problèmes de code.",
                                "- [strong]Live Server[/strong] permet de lancer un serveur local avec rechargement à chaud pour les projets web.",
                                "- [strong]GitLens[/strong] améliore les capacités de Git dans l'IDE en fournissant des informations sur les commits et les auteurs.",
                                "- [strong]Emmet[/strong] accélère le processus d'écriture de code HTML et CSS."
                            ]
                        }
                    ]
                },
                {
                    "title": "Qu'est-ce qu'Emmet ?",
                    "commands": [
                        {
                            "label": [
                                "[strong]Emmet[/strong] est un outil de productivité pour les développeurs web qui permet d'écrire du code HTML et CSS de manière plus rapide et efficace. Grâce à sa syntaxe abrégée, les utilisateurs peuvent générer des blocs de code complexes en utilisant des raccourcis simples, ce qui réduit considérablement le temps de développement.",
                                "Emmet s'intègre facilement dans de nombreux éditeurs de code et IDE, tels que Visual Studio Code, Sublime Text et Atom, et offre des fonctionnalités comme l'expansion de snippets, la complétion automatique et la navigation rapide dans le code, rendant ainsi le processus de codage plus fluide et agréable."
                            ]
                        }
                    ]
                },
                {
                    "title": "Qu'est-ce qu'un gestionnaire de paquets ? Donnez des exemples.",
                    "commands": [
                        {
                            "label": [
                                "Un [strong]gestionnaire de paquets[/strong] est un outil qui automatise l'installation, la mise à jour et la gestion des dépendances d'un projet. On peut donner les exemples suivants.",
                                "- [strong]npm (Node Package Manager)[/strong] est utilisé pour gérer les paquets JavaScript.",
                                "- [strong]Yarn[/strong] est un gestionnaire de paquets alternatif pour JavaScript, plus rapide et avec des fonctionnalités avancées.",
                                "- [strong]Composer[/strong] permet de gérer les dépendances en PHP."
                            ]
                        }
                    ]
                },
                {
                    "title": "Qu'est-ce qu'un outil de gestion de tâches ?",
                    "commands": [
                        {
                            "label": [
                                "Un [strong]outil de gestion de tâches[/strong] est un logiciel qui automatise les tâches répétitives dans le processus de développement, permettant ainsi aux développeurs de se concentrer sur des tâches plus créatives et stratégiques. Ces outils facilitent des opérations telles que la compilation de fichiers, la minification, le bundling et l'optimisation des ressources.",
                                "Parmi les outils de gestion de tâches les plus populaires, on trouve Webpack, Vite, Esbuild, Rollup et Parcel. Chacun de ces outils offre des fonctionnalités spécifiques adaptées à différents types de projets, améliorant ainsi l'efficacité et la productivité des équipes de développement."
                            ]
                        }
                    ]
                },
                {
                    "title": "Qu'est-ce que Webpack ?",
                    "commands": [
                        {
                            "label": [
                                "[strong]Webpack[/strong] est un module bundler open-source pour JavaScript, conçu pour gérer et optimiser les ressources d'applications web modernes. Il permet de regrouper les JS, le CSS, les images et le HTML en un ou plusieurs bundles statiques, facilitant ainsi leur chargement par le navigateur.",
                                "Webpack fonctionne sur le principe de modules et de dépendances, créant un graphique de dépendances qui permet aux développeurs d'utiliser une approche modulaire dans le développement de leurs applications. Grâce à un fichier de configuration, `webpack.config.js`, les développeurs peuvent définir des règles, des plugins et des tâches personnalisées pour le processus de bundling.",
                                "L'un des principaux avantages de Webpack est sa capacité à effectuer le [strong]code splitting[/strong] (ou division de code), ce qui permet de charger uniquement les parties nécessaires d'une application, améliorant ainsi les performances et l'expérience utilisateur. De plus, il propose un serveur de développement intégré avec le `hot module replacement` (HMR), permettant de mettre à jour le code sans recharger la page."
                            ]
                        }
                    ]
                },
                {
                    "title": "Qu'est-ce que Gulp ?",
                    "commands": [
                        {
                            "label": [
                                "[strong]Gulp[/strong] est un outil d'automatisation des tâches de construction (task runner) basé sur Node.js. Il permet d'automatiser et d'optimiser les étapes répétitives du workflow de développement web, comme la minification, la concaténation, les tests unitaires, l'optimisation des images, etc.",
                                "Gulp fonctionne sur le principe de pipelines. Vous définissez des tâches qui prennent des fichiers en entrée, appliquent une série de transformations à l'aide de plugins, puis écrivent les fichiers résultants à un endroit spécifié. Par exemple, une tâche pourrait récupérer tous les fichiers Sass, les compiler en CSS, ajouter les préfixes vendeurs, puis écrire le CSS final dans un dossier de distribution.",
                                "L'avantage de Gulp est qu'il vous permet d'automatiser ces tâches répétitives et chronophages, vous faisant gagner un temps précieux. De plus, en définissant ces étapes dans un fichier de configuration, votre workflow devient reproductible et partageable au sein d'une équipe."
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "title": "L'environnement",
            "items": [
                {
                    "title": "Comment configurer les variables d'environnement sur votre système ?",
                    "commands": [
                        {
                            "label": [
                                "Pour configurer les [strong]variables d'environnement[/strong] sur votre système :",
                                "- Sur Windows : Accédez à `Panneau de configuration > Système > Paramètres système avancés > Variables d'environnement` et ajoutez ou modifiez les variables nécessaires.",
                                "- Sur macOS/Linux : Ouvrez le terminal et éditez le fichier `~/.bash_profile` ou `~/.bashrc` pour ajouter des variables d'environnement, par exemple : export VARIABLE_NAME=value"
                            ]
                        }
                    ]
                },
                {
                    "title": "Qu'est-ce qu'un serveur web local ?",
                    "commands": [
                        {
                            "label": [
                                "Un [strong]serveur web local[/strong] est un logiciel qui simule un serveur web sur votre machine pour tester des applications web. Il permet de :",
                                "- Tester des applications web en conditions réelles sans les déployer.",
                                "- Développer et déboguer des fonctionnalités avant de les mettre en production.",
                                "- Travailler avec des bases de données et des langages côté serveur comme PHP.",
                                "On peut utiliser des extensions comme Live Server sur VSC, ou des solutions plus complexes, comme XAMPP, WAMP ou MAMP."
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "title": "Le versioning",
            "items": [
                {
                    "title": "Qu'est-ce qu'un logiciel de versioning ? Pourquoi est-il important ?",
                    "commands": [
                        {
                            "label": [
                                "Un [strong]logiciel de versioning[/strong] est un outil qui permet de suivre, gérer et enregistrer les modifications apportées à des fichiers ou à un ensemble de fichiers au fil du temps. Il facilite la gestion des versions de code source, permettant aux développeurs de maintenir un historique clair des modifications.",
                                "L'importance d'un logiciel de versioning réside dans plusieurs aspects clefs :",
                                "- La possibilité de revenir facilement à une version antérieure d'un fichier, ce qui aide à corriger les erreurs,",
                                "- La facilitation de la collaboration entre développeurs, permettant à plusieurs personnes de travailler simultanément sur le même projet sans écraser les modifications des autres,",
                                "- La gestion efficace des modifications et des conflits dans le code, garantissant ainsi que les intégrations se déroulent sans heurts et que le code reste stable."
                            ]
                        }
                    ]
                },
                {
                    "title": "Comment installer Git sur votre système d'exploitation ?",
                    "commands": [
                        {
                            "label": [
                                "Pour installer Git sur votre système d'exploitation :",
                                "- Téléchargez la dernière version de Git depuis le site officiel : https://git-scm.com/downloads.",
                                "- Suivez les instructions d'installation spécifiques à votre système (Windows, macOS, Linux).",
                                "- Une fois installé, vous pouvez vérifier l'installation en exécutant `git --version` dans le terminal."
                            ]
                        }
                    ]
                },
                {
                    "title": "Comment configurer Git avec vos informations personnelles ?",
                    "commands": [
                        {
                            "label": "Pour configurer Git avec vos informations personnelles, vous pouvez exécuter les commandes suivantes dans le terminal :",
                            "code": "git config --global user.name \"Votre Nom\"\ngit config --global user.email \"votre_email@example.com\""
                        }
                    ]
                },
                {
                    "title": "Quels sont les avantages d'utiliser un gestionnaire de versions comme Git ?",
                    "commands": [
                        {
                            "label": [
                                "Utiliser un gestionnaire de versions comme Git offre de nombreux avantages pour le développement de projets logiciels.",
                                "- [strong]Suivi des modifications[/strong] : Git permet de suivre l'historique complet des changements apportés aux fichiers, facilitant la compréhension de l'évolution du projet et permettant de revenir à des versions antérieures si nécessaire.",
                                "- [strong]Collaboration[/strong] : Git facilite grandement la collaboration entre développeurs en permettant à plusieurs personnes de travailler simultanément sur le même projet. Les modifications de chacun sont enregistrées et peuvent être fusionnées sans conflits.",
                                "- [strong]Branches[/strong] : Git encourage une approche de développement fondée sur les branches. Les développeurs peuvent en créer pour développer de nouvelles fonctionnalités ou corriger des bugs sans affecter le code principal. Celles-ci peuvent ensuite être fusionnées une fois le travail terminé.",
                                "- [strong]Sécurité[/strong] : Git offre une sécurité robuste avec son système de hachage cryptographique, garantissant l'intégrité du code source et empêchant toute modification non autorisée.",
                                "- [strong]Portabilité[/strong] : Les dépôts Git sont portables et peuvent être clonés sur différentes machines, permettant aux développeurs de travailler sur le projet depuis n'importe où."
                            ]
                        }
                    ]
                },
                {
                    "title": "Quelle est la différence entre Git, GitHub et GitLab ?",
                    "commands": [
                        {
                            "label": [
                                "- [strong]Git[/strong] est un système de contrôle de version distribué qui fonctionne localement sur votre machine. Il permet de suivre les modifications apportées au code source et de gérer l'historique des fichiers.",
                                "- [strong]GitHub[/strong] est une plateforme d'hébergement de dépôts Git qui permet de stocker et de partager des projets en ligne. Elle offre des outils de gestion de projet.  appartient à Microsoft depuis 2018.",
                                "- [strong]GitLab[/strong] est également une plateforme d'hébergement, mais elle se concentre sur l'intégration continue (CI/CD) et offre des fonctionnalités de gestion de projet plus avancées, tout en étant open source pour son édition Community."
                            ]
                        }
                    ]
                },
                {
                    "title": "Comment cloner un dépôt Git existant sur votre machine locale ?",
                    "commands": [
                        {
                            "label": "Pour cloner un dépôt Git existant, vous pouvez utilisez la commande suivante dans le terminal :",
                            "code": "git clone https://url_du_depot.git"
                        }
                    ]
                },
                {
                    "title": "Comment résoudre un conflit de fusion dans Git ?",
                    "commands": [
                        {
                            "label": [
                                "Pour résoudre un conflit de fusion dans Git :",
                                "- Identifiez les fichiers en conflit en utilisant `git status`.",
                                "- Ouvrez les fichiers en conflit et modifiez-les pour résoudre les conflits.",
                                "- Une fois résolus, ajoutez les fichiers avec `git add <fichier>` et terminez la fusion avec `git commit`."
                            ]
                        }
                    ]
                },
                {
                    "title": "Expliquez le concept de branches dans Git.",
                    "commands": [
                        {
                            "label": "Les [strong]branches[/strong] dans Git permettent de créer des lignes de développement séparées.Cela permet de travailler sur des fonctionnalités ou des corrections sans affecter le code principal. Les branches peuvent être fusionnées une fois le travail terminé."
                        }
                    ]
                },
                {
                    "title": "Qu'est-ce qu'un fichier .gitignore et à quoi sert-il ? Comment le créer ?",
                    "commands": [
                        {
                            "label": [
                                "Un fichier [strong].gitignore[/strong] est un fichier qui indique à Git quels fichiers ou répertoires ignorer dans un projet. Pour créer un fichier .gitignore :",
                                "- Créez un fichier nommé `.gitignore` à la racine de votre dépôt.",
                                "- Ajoutez les noms de fichiers ou de répertoires à ignorer, par exemple : node_modules/*.log "
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "title": "Le HTML",
            "items": [
                {
                    "title": "Qu'est-ce que HTML ?",
                    "commands": [
                        {
                            "label": "[strong]HTML (HyperText Markup Language)[/strong] est le langage standard utilisé pour créer des pages web. Il sert à structurer le contenu sur le web, en utilisant des balises pour définir des éléments comme des titres, des paragraphes, des images et des liens. HTML a été créé par [strong]Tim Berners-Lee[/strong] en 1989 au [strong]CERN[/strong] (Organisation européenne pour la recherche nuclefaire)."
                        }
                    ]
                },
                {
                    "title": "Quelle est la différence entre HTML et XHTML ?",
                    "commands": [
                        {
                            "label": [
                                "HTML est un langage de balisage plus permissif, tandis que XHTML (Extensible HyperText Markup Language) est une version plus stricte de HTML basée sur XML.",
                                "XHTML impose des règles de syntaxe plus rigoureuses, comme la nécessité de fermer toutes les balises et d'utiliser des noms de balises en minuscules."
                            ]
                        }
                    ]
                },
                {
                    "title": "Quelles sont les principales versions de HTML et quelles sont leurs différences ?",
                    "commands": [
                        {
                            "label": [
                                "Voici les principales versions de HTML avec leur année de sortie et leurs changements majeurs :",
                                "[strong]HTML 2.0[/strong] (1995) : Première version standardisée, introduisant les formulaires et les tables",
                                "[strong]HTML 3.2[/strong] (1997) : Ajout du support pour les feuilles de style, les scripts et les applets",
                                "[strong]HTML 4.01[/strong] (1999) : Amélioration de l'accessibilité, internationalisation, et séparation du contenu et de la présentation",
                                "[strong]XHTML 1.0[/strong] (2000) : Reformulation de HTML 4.01 en XML, avec une syntaxe plus stricte",
                                "[strong]HTML5[/strong] (2014) : Introduction d'éléments sémantiques, support natif de l'audio et de la vidéo, canvas pour le dessin, et amélioration des formulaires"
                            ]
                        }
                    ]
                },
                {
                    "title": "Qu'est-ce qu'une balise HTML ? Comment est-elle structurée ?",
                    "commands": [
                        {
                            "label": "Une balise HTML est un élément de base qui définit le contenu d'une page web. Elle est généralement structurée avec une balise d'ouverture et une balise de fermeture, par exemple :",
                            "code": "<balise propriete=\"valeur\">contenu </balise>"
                        }
                    ]
                },
                {
                    "title": "Qu'est-ce qu'un attribut dans une balise HTML ? Donnez un exemple.",
                    "commands": [
                        {
                            "label": "Un attribut fournit des informations supplémentaires sur une balise HTML. Par exemple, dans la balise ci-dessous 'src' et 'alt' sont des attributs.",
                            "code": "<img src=\"image.jpg\" alt=\"Description\">"
                        }
                    ]
                },
                {
                    "title": "Qu'est-ce que le DOCTYPE en HTML ?",
                    "commands": [
                        {
                            "label": "Le DOCTYPE est une déclaration qui informe le navigateur du type de document et de la version de HTML utilisée. Il est important, car il permet au navigateur de créer correctement la page en respectant les standards du web. Vous pouvez le déclarer de cette manière-là :",
                            "code": "<!DOCTYPE html>"
                        }
                    ]
                },
                {
                    "title": "Quelle est la structure de base d'un fichier HTML ?",
                    "commands": [
                        {
                            "label": [
                                "La structure de base d'un fichier HTML comprend les éléments suivants :",
                                "- La déclaration DOCTYPE",
                                "- L'élément <html> avec l'attribut de langue",
                                "- La section <head> contenant les métadonnées",
                                "- La section <body> contenant le contenu visible de la page",
                                "Voici un exemple de structure de base :"
                            ],
                            "code": "<!DOCTYPE html>\n<html lang=\"fr\">\n<head>\n  <meta charset=\"UTF-8\">\n  <meta\n    name=\"viewport\" \n    content=\"width=device-width, initial-scale=1.0\">\n  <title>Document</title>\n</head>\n<body>\n\n</body>\n</html>"
                        }
                    ]
                },
                {
                    "title": "Comment le HTML interagit-il avec CSS et JavaScript ?",
                    "commands": [
                        {
                            "label": [
                                "Le [strong]HTML[/strong] structure le contenu d'une page, tandis que [strong]CSS (Cascading Style Sheets)[/strong] est utilisé pour la mise en forme et le style.",
                                "Le [strong]JavaScript[/strong], quant à lui, permet d'ajouter de l'interactivité à la page en manipulant le [strong]DOM (Document Object Model)[/strong] généré par HTML."
                            ]
                        }
                    ]
                },
                {
                    "title": "Comment les métadonnées sont-elles utilisées dans une page HTML ?",
                    "commands": [
                        {
                            "label": [
                                "Les métadonnées sont des informations sur la page qui ne sont pas affichées directement à l'utilisateur, mais qui fournissent des données importantes aux navigateurs et aux moteurs de recherche.",
                                "Elles sont généralement définies dans la section <head> de la page HTML, principalement avec des balises <meta>. Ci-dessous sont présentés des exemples courants de métadonnées."
                            ]
                        },
                        {
                            "label": "Encodage des caractères :",
                            "code": "<meta charset=\"UTF-8\">"
                        },
                        {
                            "label": "Description de la page (importante pour le SEO) :",
                            "code": "<meta\n  name=\"description\"\n  content=\"Description concise de la page pour les moteurs de recherche\"\n  >"
                        },
                        {
                            "label": "Mots-clefs (moins utilisés aujourd'hui pour le SEO) :",
                            "code": "<meta \n  ame=\"keywords\"\n  content=\"mot-clef1, mot-clef2, mot-clef3\"\n>"
                        },
                        {
                            "label": "Auteur de la page :",
                            "code": "<meta\n  name=\"author\"\n  content=\"Nom de l'auteur\"\n>"
                        },
                        {
                            "label": "Viewport pour le responsive design :",
                            "code": "<meta\n  name=\"viewport\"\n  content=\"width=device-width, initial-scale=1.0\"\n>"
                        },
                        {
                            "label": "Robots (instructions pour les moteurs de recherche) :",
                            "code": "<meta\n  name=\"robots\"\n  content=\"index, follow\"\n>"
                        }
                    ]
                },
                {
                    "title": "Qu'est-ce que le HTML sémantique ?",
                    "commands": [
                        {
                            "label": "Le [strong]HTML sémantique[/strong] désigne l'utilisation de balises HTML qui transmettent la signification du contenu qu'elles renferment. Il est important, car il améliore l'accessibilité pour les technologies d'assistance. Il favorise aussi [strong]le référencement naturel (SEO)[/strong] en permettant aux moteurs de recherche de mieux comprendre la structure et le contenu de la page."
                        }
                    ]
                },
                {
                    "title": "Comment créer des liens internes et externes en HTML ?",
                    "commands": [
                        {
                            "label": "Pour créer un lien interne, utilisez la balise <a> avec l'attribut href pointant vers un identifiant dans la même page :",
                            "code": "<a href=\"#section1\">\n  Aller à la section 1\n</a>"
                        },
                        {
                            "label": "Pour créer un lien externe, utilisez également la balise <a> avec l'URL complète :",
                            "code": "<a href=\"https://www.example.com\">\n  Visitez Example\n</a>."
                        }
                    ]
                },
                {
                    "title": "Comment utiliser les commentaires dans le code HTML ?",
                    "commands": [
                        {
                            "label": "Les [strong]commentaires[/strong] en HTML sont utilisés pour ajouter des notes ou des explications dans le code sans qu'elles soient affichées dans le navigateur. Ils sont écrits en utilisant la syntaxe suivante :",
                            "code": "<!-- Ceci est un commentaire -->."
                        }
                    ]
                },
                {
                    "title": "Qu'est-ce que l'attribut data-* en HTML ?",
                    "commands": [
                        {
                            "label": "L'attribut [strong]data-*[/strong] est un attribut personnalisé qui permet de stocker des données supplémentaires sur un élément HTML. Dans l'exemple ci-dessous, on peut utiliser le data-user-id afin de manipuler l'élément en question.",
                            "code": "<div data-user-id=\"12345\">Contenu</div>"
                        }
                    ]
                },
                {
                    "title": "Comment éviter les erreurs dans l'écriture du HTML ?",
                    "commands": [
                        {
                            "label": "Il est important de valider le code HTML avec des outils comme le validateur W3C pour détecter les erreurs de syntaxe."
                        }
                    ]
                },
                {
                    "title": "Comment optimiser le chargement des ressources en HTML ?",
                    "commands": [
                        {
                            "label": [
                                "Pour optimiser le [strong]chargement des ressources[/strong] en HTML, vous pouvez :",
                                "- Utiliser des balises <link> et <script> avec l'attribut 'defer' ou 'async' pour charger les scripts de manière asynchrone.",
                                "- Minimiser le nombre de requêtes HTTP en combinant les fichiers CSS et JavaScript.",
                                "- Compresser les images et utiliser des formats modernes comme WebP."
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "title": "Le CSS",
            "items": [
                {
                    "title": "Qu'est-ce que CSS ?",
                    "commands": [
                        {
                            "label": "[strong]CSS (Cascading Style Sheets)[/strong] est un langage de feuilles de style utilisé pour décrire la présentation d'un document structuré en HTML. Il permet de contrôler l'apparence et la mise en forme des éléments sur une page web, comme les couleurs, les polices, les tailles, les positionnements, etc."
                        }
                    ]
                },
                {
                    "title": "Qu'est-ce qu'un sélecteur ? Donnez des exemples.",
                    "commands": [
                        {
                            "label": [
                                "Un [strong]sélecteur en CSS[/strong] est un motif utilisé pour sélectionner les éléments HTML que vous souhaitez styliser. Les sélecteurs permettent d'appliquer des styles spécifiques à des éléments particuliers ou à des groupes d'éléments. Voici quelques exemples de sélecteurs :",
                                "- [strong]Sélecteur de type[/strong] : `p { color: blue; }` cible tous les éléments <p>.",
                                "- [strong]Sélecteur de classe[/strong] : `.ma-classe { font-size: 16px; }` cible tous les éléments ayant la classe 'ma-classe'.",
                                "- [strong]Sélecteur d'identifiant[/strong] : `#mon-id { background-color: yellow; }` cible l'élément ayant l'identifiant 'mon-id'.",
                                "- [strong]Sélecteur d'attribut[/strong] : `input[type = 'text'] { border: 1px solid black; }` cible tous les éléments <input> de type 'text'.",
                                "- [strong]Sélecteur descendant[/strong] : `div p { margin: 10px; }` cible tous les éléments <p> qui sont des descendants d'un élément <div>."
                            ]
                        }
                    ]
                },
                {
                    "title": "Quelle est la différence entre les sélecteurs de classes et d'identifiants en CSS ?",
                    "commands": [
                        {
                            "label": "Les [strong]sélecteurs de classes[/strong] en CSS permettent d'appliquer des styles à des éléments en fonction de leur classe, par exemple : .ma-classe { ... }. Les [strong]sélecteurs d'identifiants[/strong], quant à eux, ciblent des éléments uniques avec un identifiant unique, par exemple : #mon-id { ... }. Les identifiants ont une priorité plus élevée que les classes."
                        }
                    ]
                },
                {
                    "title": "Comment appliquer des styles CSS à un document HTML ?",
                    "commands": [
                        {
                            "label": [
                                "Il existe trois façons d'appliquer des styles CSS à un document HTML :",
                                "- [strong]Styles en ligne[/strong] : <p style=\"color: red;\">Texte rouge</p>",
                                "- [strong]Balise <style> dans l'en-tête[/strong] : <style> p { color: red; } </style>",
                                "- [strong]Feuille de style externe[/strong] : <link rel=\"stylesheet\" href=\"styles.css\">"
                            ]
                        }
                    ]
                },
                {
                    "title": "Qu'est-ce que le modèle de boîte en CSS ?",
                    "commands": [
                        {
                            "label": "Le [strong]modèle de boîte[/strong] en HTML et en CSS décrit la façon dont les éléments sont affichés et dimensionnés sur une page. Chaque élément est considéré comme une boîte, avec des propriétés telles que la marge, la bordure, le remplissage et le contenu. En modulan, chacune d'entre-elles, vous pouvez faire évoluer votr emise en page."
                        }
                    ]
                },
                {
                    "title": "Comment fonctionne le positionnement en CSS (static, relative, absolute, fixed) ?",
                    "commands": [
                        {
                            "label": [
                                "Le CSS offre différentes options de positionnement :",
                                "- [strong]Static (par défaut)[/strong] : positionnement normal dans le flux du document.",
                                "- [strong]Relative[/strong] : positionnement par rapport à sa position normale.",
                                "- [strong]Absolute[/strong] : positionnement par rapport au parent positionné le plus proche.",
                                "- [strong]Fixed[/strong] : positionnement par rapport à la fenêtre du navigateur."
                            ]
                        }
                    ]
                },
                {
                    "title": "Qu'est-ce que Flexbox ?",
                    "commands": [
                        {
                            "label": [
                                "[strong]Flexbox[/strong] (Flexible Box Layout) est un [strong]module CSS[/strong] conçu pour faciliter la création de mises en page flexibles et réactives. Il introduit un modèle de disposition unidimensionnel, permettant d'organiser les éléments en lignes ou en colonnes. On peut retenir les caractéristiques suivantes :",
                                "- la [strong]direction[/strong] qui permet de définir l'axe principal (horizontal ou vertical) le long duquel les éléments sont disposés ;",
                                "- l'[strong]alignement[/strong] qui offre un contrôle précis sur l'alignement des éléments le long des axes principal et secondaire.",
                                "- l'[strong]ordre[/strong] qui permet de modifier l'ordre d'affichage des éléments indépendamment de leur ordre dans le DOM ;",
                                "- la [strong]flexibilité[/strong] permettant aux éléments de grandir ou rétrécir en fonction de l'espace disponible ;",
                                "- la [strong]distribution de l'espace[/strong] qui gère efficacement la répartition de l'espace entre et autour des éléments.",
                                "Flexbox est particulièrement utile pour créer des mises en page responsives, des barres de navigation, des grilles simples, et pour centrer des éléments verticalement et horizontalement. Il simplifie considérablement de nombreux défis de mise en page qui étaient auparavant complexes avec les méthodes CSS traditionnelles."
                            ]
                        }
                    ]
                },
                {
                    "title": "Qu'est-ce que CSS Grid ?",
                    "commands": [
                        {
                            "label": [
                                "Le module [strong]CSS Grid[/strong] est un système de mise en page en deux dimensions qui permet de diviser une page en lignes et colonnes. Il offre un contrôle précis sur la disposition des éléments dans un espace bidimensionnel. On peut retenir les caractéristiques suivantes :",
                                "- les [strong]grilles explicites[/strong] qui permettent de définir précisément le nombre et la taille des lignes et des colonnes ;",
                                "- les [strong]grilles implicites[/strong] qui sont générées automatiquement lorsque le contenu déborde de la grille explicite ;",
                                "- le [strong]positionnement[/strong] qui permet de placer des éléments dans des cellules spécifiques de la grille ;",
                                "- le [strong]contrôle de la taille[/strong] des lignes et des colonnes, avec des unités flexibles comme fr (fraction) ;",
                                "- les [strong]espaces[/strong] (gutters) entre les lignes et les colonnes, facilement ajustables ;",
                                "- l'[strong]alignement[/strong] du contenu à l'intérieur des cellules de la grille.",
                                "CSS Grid est particulièrement efficace pour créer des mises en page complexes, des interfaces utilisateur responsives, et des structures de page entières. Il offre une flexibilité et un contrôle supérieurs à ceux des méthodes de mise en page traditionnelles, permettant des designs plus sophistiqués avec moins de code."
                            ]
                        }
                    ]
                },
                {
                    "title": "Comment gérer les polices et les typographies en CSS ?",
                    "commands": [
                        {
                            "label": [
                                "Le CSS permet de contrôler les polices et les typographies de différentes manières :",
                                "- Utiliser des propriétés comme `font-family`, `font-size`, `font-weight`, etc.",
                                "- Importer des polices externes avec @font-face ou des services de polices en ligne.",
                                "- Utiliser des unités relatives comme `em` et `rem` pour une mise à l'échelle flexible."
                            ]
                        }
                    ]
                },
                {
                    "title": "Qu'est-ce qu'une pseudo-classe et comment l'utiliser ?",
                    "commands": [
                        {
                            "label": "Une [strong]pseudo-classe[/strong] en CSS est un mot-clef ajouté à un sélecteur qui spécifie un état particulier de l'élément ciblé. L'exemple ci-dessous cible les liens lorsque l'utilisateur survole l'élément avec la souris.",
                            "code": "a:hover {\n  color: red;\n}"
                        }
                    ]
                },
                {
                    "title": "Comment créer des animations et des transitions en CSS ?",
                    "commands": [
                        {
                            "label": [
                                "Le CSS permet de créer des animations et des transitions de différentes manières :",
                                "- [strong]Transitions[/strong] : utilisez les propriétés transition-property, transition-duration, etc. pour animer les changements d'état.",
                                "- [strong]Animations[/strong] : définissez des keyframes avec @keyframes et appliquez-les avec la propriété animation."
                            ]
                        }
                    ]
                },
                {
                    "title": "Qu'est-ce que la spécificité en CSS ? Comment fonctionne-t-elle ?",
                    "commands": [
                        {
                            "label": [
                                "La [strong]spécificité en CSS[/strong] est un système de points qui détermine quelle règle CSS a la priorité pour un élément donné. Elle se fonde sur le nombre et le type de sélecteurs utilisés. Les identifiants ont la priorité la plus élevée, suivis des classes, des attributs et des éléments. Voici comment la spécificité est calculée :",
                                "- Identifiant avec 100 points,",
                                "- Classe, attribut et pseudo-classe avec 10 points,",
                                "- Élément et pseudo-élément avec 1 point.",
                                "Par exemple, si vous avez les règles suivantes :"
                            ],
                            "code": "#mon-id { color: red; }\n\n.ma-classe { color: blue; }\n\np { color: green; }"
                        },
                        {
                            "label": [
                                "Pour un élément <p class=\"ma-classe\" id=\"mon-id\">, la spécificité est calculée comme suit :",
                                "- la règle #mon-id vaut 100 points,",
                                "- la règle .ma-classe vaut 10 points,",
                                "- la règle p vaut 1 point.",
                                "L'élément <p class=\"ma-classe\" id=\"mon-id\"> aura la couleur de texte rouge, car l'identifiant a une spécificité plus élevée que la classe, qui a elle-même une spécificité plus élevée que l'élément."
                            ]
                        }
                    ]
                },
                {
                    "title": "Comment utiliser les variables CSS ?",
                    "commands": [
                        {
                            "label": [
                                "Les [strong]variables CSS[/strong], également connues sous le nom de Custom Properties, permettent de stocker et de réutiliser des valeurs dans une feuille de style.",
                                "Définissez une variable avec -- et référencez-la avec var(). Elles peuvent être déclarées au niveau global ou local.",
                                "Voici un exemple de déclaration et d'utilisation :"
                            ],
                            "code": ":root {\n\t--primary-color: #3498db;\n\t--secondary-color: #2ecc71;\n}\n\nbody {\n\tcolor: var(--primary-color);\n}\n\n.button {\n\tcolor: var(--secondary-color);\n\tcolor: white;\n\tpadding: 10px 20px;\n\tborder: none;\n\tborder-radius: 5px;\n\tcursor: pointer;\n}"
                        }
                    ]
                },
                {
                    "title": "Qu'est-ce qu'un préprocesseur CSS ?",
                    "commands": [
                        {
                            "label": [
                                "Un [strong]préprocesseur CSS[/strong] est un langage qui étend les fonctionnalités de CSS, permettant d'utiliser des fonctionnalités avancées comme les variables, les mixins, les fonctions et l'imbrication. Ces langages sont compilés en CSS standard avant d'être utilisés dans le navigateur. Voici deux exemples :",
                                "- [strong]Sass (Syntactically Awesome Style Sheets)[/strong] est un préprocesseur qui offre des fonctionnalités avancées pour écrire du CSS de manière plus efficace. SCSS (Sassy CSS) est une syntaxe de Sass qui est plus proche du CSS traditionnel, permettant d'utiliser des fonctionnalités supplémentaires tout en conservant la syntaxe CSS.",
                                "- [strong]LESS[/strong] est un préprocesseur qui permet également d'utiliser des fonctionnalités avancées comme les variables, les mixins, les fonctions et l'imbrication, rendant le CSS plus dynamique et maintenable."
                            ]
                        }
                    ]
                },
                {
                    "title": "Qu'est-ce qu'un framework CSS ?",
                    "commands": [
                        {
                            "label": [
                                "Un [strong]framework CSS[/strong] est une bibliothèque de styles préconçus qui facilite le développement de sites web en fournissant des composants et des styles réutilisables. Ils permettent de gagner du temps et d'assurer la cohérence visuelle. Voici quatre exemples :",
                                "- [strong]Bootstrap[/strong] est un framework CSS populaire qui fournit des composants et des styles préconçus pour faciliter le développement de sites web responsives, incluant une grille flexible, des boutons, des formulaires et d'autres éléments d'interface utilisateur.",
                                "- [strong]Tailwind CSS[/strong] est un framework CSS utilitaire qui permet de créer des designs personnalisés rapidement en utilisant des classes utilitaires. Contrairement à d'autres, il ne fournit pas de composants préconçus, mais offre une grande flexibilité pour construire des interfaces."
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "title": "L'accessibilité",
            "items": [
                {
                    "title": "Qu'est-ce que l'accessibilité numérique ?",
                    "commands": [
                        {
                            "label": "L'[strong]accessibilité numérique[/strong] désigne le fait de rendre les contenus et les services en ligne utilisables par tous, y compris les personnes en situation de handicap. On pense alors aux sites web, aux applications, aux documents et aux médias numériques."
                        }
                    ]
                },
                {
                    "title": "Pourquoi l'accessibilité est-elle importante pour les utilisateurs en situation de handicap ?",
                    "commands": [
                        {
                            "label": [
                                "L'accessibilité numérique est nécessaire pour permettre aux utilisateurs en situation de handicap d'accéder à l'information et aux services en ligne. Elle [strong]garantit l'égalité des droits et des opportunités[/strong], permettant à chacun de participer pleinement à la société numérique."
                            ]
                        }
                    ]
                },
                {
                    "title": "Quels sont les principaux standards et référentiels d'accessibilité ?",
                    "commands": [
                        {
                            "label": [
                                "Les [strong]WCAG (Web Content Accessibility Guidelines)[/strong] sont des directives internationales qui fournissent des recommandations pour rendre le contenu web plus accessible.",
                                "Le [strong]RGAA (Référentiel Général d'Amélioration de l'Accessibilité)[/strong] est un cadre français qui s'inspire des WCAG et établit des critères spécifiques pour l'accessibilité des sites publics."
                            ]
                        }
                    ]
                },
                {
                    "title": "Comment intégrer l'accessibilité dès la phase de conception d'un site web ?",
                    "commands": [
                        {
                            "label": "Pour intégrer l'accessibilité dès la phase de conception, il est essentiel de suivre une approche centrée sur l'utilisateur et de considérer les besoins des utilisateurs en situation de handicap. Cela passe par la création de maquettes accessibles, l'utilisation de balises sémantiques et la planification de tests d'accessibilité tout au long du processus de développement."
                        }
                    ]
                },
                {
                    "title": "Quelles sont les erreurs courantes à éviter ?",
                    "commands": [
                        {
                            "label": [
                                "Les erreurs suivantes sont à éviter :",
                                "- l'utilisation de couleurs à faible contraste,",
                                "- l'absence de textes alternatifs pour les images,",
                                "- les formulaires non accessibles,",
                                "- les éléments cliquables non accessibles au clavier,",
                                "- le manque de balises sémantiques appropriées,"
                            ]
                        }
                    ]
                },
                {
                    "title": "Comment les technologies d'assistance interagissent-elles avec le contenu web ?",
                    "commands": [
                        {
                            "label": "Les technologies d'assistance, comme les lecteurs d'écran, interprètent le contenu HTML et le convertissent en audio ou en braille pour les utilisateurs. Elles dépendent de balises sémantiques appropriées et d'attributs ARIA pour fournir une navigation et une compréhension efficaces du contenu. Voici quelques exemples : <header>, <nav>, <main>, <article>, <section>, <footer>, <img alt=\"description\">, et les attributs ARIA comme role, aria-label, et aria-hidden."
                        }
                    ]
                },
                {
                    "title": "Quelles pratiques de design peuvent améliorer l'accessibilité d'un site web ?",
                    "commands": [
                        {
                            "label": [
                                "Les pratiques de design qui améliorent l'accessibilité comprennent :",
                                "- l'utilisation de polices lisibles (sans-serif),",
                                "- le choix de couleurs avec un bon contraste,",
                                "- la création de mises en page flexibles,",
                                "- l'utilisation de balises sémantiques,",
                                "- la structuration logique du contenu."
                            ]
                        }
                    ]
                },
                {
                    "title": "Comment tester l'accessibilité d'un site web ?",
                    "commands": [
                        {
                            "label": "Pour tester l'accessibilité d'un site web, vous pouvez utiliser des outils d'évaluation automatisés comme [strong]WAVE[/strong], ou le [strong]Lighthouse[/strong] du navigateur Chrome. Des tests manuels avec des technologies d'assistance peuvent être réalisés. Il est également recommandé d'impliquer des utilisateurs en situation de handicap dans le processus de test."
                        }
                    ]
                },
                {
                    "title": "Quelles sont les obligations légales pour les entreprises ?",
                    "commands": [
                        {
                            "label": [
                                "Les entreprises doivent respecter des lois sur l'accessibilité, telles que le [strong]RGAA[/strong] en France ou l'[strong]ADA[/strong] aux États-Unis.",
                                "Les obligations comprennent :",
                                "- Assurer l'accessibilité des sites web pour les personnes en situation de handicap,",
                                "- Suivre les normes d'accessibilité définies par le RGAA ou l'ADA,",
                                "- Fournir des contenus alternatifs pour les médias non textuels,",
                                "- Rendre les formulaires et éléments interactifs accessibles au clavier,",
                                "- Effectuer des tests d'accessibilité réguliers pour garantir la conformité."
                            ]
                        }
                    ]
                },
                {
                    "title": "Comment l'accessibilité peut-elle bénéficier à tous les utilisateurs, pas seulement à ceux en situation de handicap ?",
                    "commands": [
                        {
                            "label": "L'accessibilité bénéficie à tous les utilisateurs en améliorant l'expérience utilisateur globale, par exemple en rendant le contenu plus facile à lire et à naviguer. Des fonctionnalités accessibles, comme des options de navigation claires et un contenu bien structuré, profitent à tous, y compris aux utilisateurs sur des appareils mobiles ou dans des environnements difficiles."
                        }
                    ]
                }
            ]
        },
        {
            "title": "Le DOM",
            "items": [
                {
                    "title": "Qu'est-ce que le DOM ?",
                    "commands": [
                        {
                            "label": "Le [strong]DOM (Document Object Model)[/strong] est une interface de programmation pour les documents HTML et XML. Il définit la structure logique des documents et la façon dont on accède aux éléments du dom et on les manipule."
                        }
                    ]
                },
                {
                    "title": "Comment le DOM représente-t-il la structure d'un document HTML ?",
                    "commands": [
                        {
                            "label": "Le DOM représente les documents sous forme d'arbres d'objets, où chaque élément généré à partir du balisage, comme un paragraphe, un titre ou un bouton de formulaire, forme un [strong]nœud[/strong]. Il définit également des fonctions permettant de se déplacer dans cet arbre, d'y ajouter, modifier ou supprimer des éléments."
                        }
                    ]
                },
                {
                    "title": "Qu'est-ce qu'un nœud dans le contexte du DOM ?",
                    "commands": [
                        {
                            "label": "Dans le DOM, les documents sont représentés par une structure d'arbre composée de nœuds, qui sont reliés entre eux de manière hiérarchique. Chaque nœud peut avoir 0, 1 ou plusieurs nœuds enfants dépendants, appelés nœuds enfants. Les nœuds situés au même niveau et dépendant du même nœud parent sont appelés nœuds frères."
                        }
                    ]
                },
                {
                    "title": "Qu'est-ce qu'un élément dans le DOM ?",
                    "commands": [
                        {
                            "label": "Dans le DOM, chaque balise HTML forme un élément, qui est un type de nœud. Les éléments sont les seuls nœuds pouvant contenir des attributs et à partir desquels d'autres nœuds peuvent dériver."
                        }
                    ]
                },
                {
                    "title": "Quelles sont les principales méthodes pour accéder au DOM ?",
                    "commands": [
                        {
                            "label": [
                                "Les principales méthodes pour accéder aux éléments du DOM sont les suivantes :",
                                "- [strong]getElementById()[/strong]",
                                "- [strong]getElementsByClassName()[/strong]",
                                "- [strong]getElementsByTagName()[/strong]",
                                "- [strong]querySelector()[/strong]"
                            ]
                        }
                    ]
                },
                {
                    "title": "Comment modifier le contenu d'un élément ?",
                    "commands": [
                        {
                            "label": "Pour modifier le contenu d'un élément dans le DOM, vous pouvez utiliser des propriétés comme [strong]innerHTML[/strong] ou [strong]textContent[/strong], ou des méthodes comme [strong]appendChild()[/strong] et [strong]removeChild()[/strong]."
                        }
                    ]
                },
                {
                    "title": "Comment ajouter un nouvel élément ?",
                    "commands": [
                        {
                            "label": "Pour ajouter un nouvel élément au DOM, vous pouvez utiliser la méthode [strong]createElement()[/strong] pour créer l'élément, puis [strong]appendChild()[/strong] ou [strong]insertBefore()[/strong] pour l'insérer à l'endroit souhaité dans l'arbre."
                        }
                    ]
                },
                {
                    "title": "Comment supprimer un élément ?",
                    "commands": [
                        {
                            "label": "Pour supprimer un élément du DOM, vous pouvez utiliser la méthode [strong]removeChild()[/strong] sur le nœud parent de l'élément à supprimer."
                        }
                    ]
                },
                {
                    "title": "Qu'est-ce qu'un événement dans le DOM ?",
                    "commands": [
                        {
                            "label": "Les événements dans le DOM sont des scripts exécutés par le navigateur lorsque l'utilisateur interagit avec la page web, comme un clic de souris ou une saisie de clavier."
                        }
                    ]
                },
                {
                    "title": "Comment gérer les événements dans le DOM ?",
                    "commands": [
                        {
                            "label": "Pour gérer les [strong]événements dans le DOM[/strong], vous pouvez utiliser des gestionnaires d'événements comme [strong]addEventListener()[/strong] pour attacher des fonctions de rappel aux événements des éléments."
                        }
                    ]
                },
                {
                    "title": "Qu'est-ce que la propagation d'événements ?",
                    "commands": [
                        {
                            "label": "La [strong]propagation d'événements[/strong] dans le DOM fait référence au comportement par défaut des événements qui remonte dans l'arbre du DOM à partir de l'élément cible jusqu'à l'élément racine. Ce comportement peut être contrôlé avec des méthodes comme [strong]stopPropagation()[/strong]."
                        }
                    ]
                },
                {
                    "title": "Comment manipuler les styles CSS d'un élément via le DOM ?",
                    "commands": [
                        {
                            "label": "Pour manipuler les styles CSS d'un élément via le DOM, vous pouvez accéder à la propriété [strong]style[/strong] de l'élément et définir les propriétés CSS souhaitées, comme `element.style.color = 'red'`."
                        }
                    ]
                },
                {
                    "title": "Comment peut-on naviguer dans le DOM ?",
                    "commands": [
                        {
                            "label": "Pour naviguer dans le DOM, vous pouvez utiliser des propriétés comme [strong]parentNode[/strong], [strong]childNodes[/strong], [strong]firstChild[/strong], [strong]lastChild[/strong], [strong]nextSibling[/strong] et [strong]previousSibling[/strong] pour vous déplacer entre les nœuds parents, enfants et frères."
                        }
                    ]
                },
                {
                    "title": "Qu'est-ce que le DOM virtuel et comment est-il utilisé dans des bibliothèques comme React ?",
                    "commands": [
                        {
                            "label": "Le [strong]DOM virtuel[/strong] est une représentation en mémoire de l'arbre du DOM, utilisée par des bibliothèques comme [strong]React[/strong] pour optimiser les mises à jour du DOM réel. Lorsque l'état de l'application change, React calcule les différences entre le DOM virtuel et le DOM réel, puis applique uniquement les changements nécessaires au DOM réel, améliorant ainsi les performances."
                        }
                    ]
                }
            ]
        },
        {
            "title": "Le responsive design",
            "items": [
                {
                    "title": "Qu'est-ce que le responsive design en CSS et comment l'implémenter ?",
                    "commands": [
                        {
                            "label": "Le responsive design en CSS permet de créer des mises en page adaptables à différentes tailles d'écran. Utilisez des unités de mesure flexibles (%, em, rem), des media queries et des grilles fluides pour créer des designs réactifs."
                        }
                    ]
                },
                {
                    "title": "Qu'est-ce qu'un breakpoint en responsive design ?",
                    "commands": [
                        {
                            "label": [
                                "Un breakpoint est une valeur de largeur d'écran définie dans les media queries qui détermine à quel moment le design d'une page web doit changer pour s'adapter à différentes tailles d'écran."
                            ]
                        }
                    ]
                },
                {
                    "title": "Quels sont les différents breakpoints et les écrans qui leur sont associés ?",
                    "commands": [
                        {
                            "label": [
                                "Les breakpoints courants incluent :",
                                "- [strong]320px[/strong] : Smartphones en mode portrait",
                                "- [strong]480px[/strong] : Smartphones en mode paysage",
                                "- [strong]768px[/strong] : Tablettes en mode portrait",
                                "- [strong]1024px[/strong] : Tablettes en mode paysage",
                                "- [strong]1200px[/strong] : Ordinateurs de bureau"
                            ]
                        }
                    ]
                },
                {
                    "title": "Pourquoi est-il important de définir des breakpoints adaptés ?",
                    "commands": [
                        {
                            "label": "Définir des [strong]breakpoints adaptés[/strong] lors dès le début de la conception du site permet d'assurer que le contenu est lisible et accessible sur tous les appareils. Cela améliore l'expérience utilisateur et réduit le taux de rebond."
                        }
                    ]
                },
                {
                    "title": "Quelles sont les meilleures pratiques pour choisir des breakpoints efficaces ?",
                    "commands": [
                        {
                            "label": [
                                "Afin de choisir des [strong]breakpoints[/strong], vous pouvez :",
                                "- analyser les données d'utilisation pour identifier les tailles d'écran les plus courantes,",
                                "- tester le design sur différents appareils pour déterminer les points de rupture nécessaires",
                                "- utiliser des breakpoints basés sur le contenu plutôt que sur des tailles d'écran fixes."
                            ]
                        }
                    ]
                },
                {
                    "title": "Comment les media queries sont-elles utilisées pour gérer le responsive design ?",
                    "commands": [
                        {
                            "label": "Les [strong]media queries[/strong] sont des règles CSS qui appliquent des styles spécifiques en fonction des caractéristiques de l'appareil, comme la largeur de l'écran. Elles permettent de modifier la mise en page et le style en fonction des breakpoints définis."
                        }
                    ]
                },
                {
                    "title": "Comment tester l'affichage d'un site web sur différents appareils et tailles d'écran ?",
                    "commands": [
                        {
                            "label": "Pour tester l'affichage, vous pouvez utiliser des outils de développement dans les navigateurs, comme les outils de simulation de taille d'écran. Des services en ligne comme BrowserStack ou Responsinator permettent également de tester sur une variété d'appareils."
                        }
                    ]
                },
                {
                    "title": "Comment le responsive design améliore-t-il l'expérience utilisateur ?",
                    "commands": [
                        {
                            "label": "Le [strong]responsive design[/strong] améliore l'expérience utilisateur en garantissant que le contenu est accessible et facile à naviguer sur tous les appareils. Il réduit le besoin de zoomer ou de faire défiler horizontalement, rendant la navigation plus fluide."
                        }
                    ]
                },
                {
                    "title": "Quels outils peuvent aider à créer des designs responsives ?",
                    "commands": [
                        {
                            "label": [
                                "Des outils comme [strong]Figma[/strong], [strong]Adobe XD[/strong], et Sketch permettent de concevoir des interfaces responsives.",
                                "Des frameworks CSS comme [strong]Bootstrap[/strong] et [strong]Foundation[/strong] offrent des grilles et des composants prêts à l'emploi pour le responsive design."
                            ]
                        }
                    ]
                },
                {
                    "title": "Qu'est-ce que le design adaptatif et comment diffère-t-il du responsive design ?",
                    "commands": [
                        {
                            "label": [
                                "Le design adaptatif utilise plusieurs mises en page fixes qui s'adaptent à des tailles d'écran spécifiques, tandis que le responsive design utilise une seule mise en page fluide qui s'ajuste dynamiquement à toutes les tailles d'écran."
                            ]
                        }
                    ]
                },
                {
                    "title": "Comment la balise meta viewport influence-t-elle le responsive design ?",
                    "commands": [
                        {
                            "label": "La balise [strong]meta viewport[/strong] permet de contrôler la mise à l'échelle et les dimensions de la page sur les appareils mobiles. Elle est essentielle pour garantir que le design responsive fonctionne correctement sur les écrans de différentes tailles."
                        }
                    ]
                },
                {
                    "title": "Quelles sont les techniques CSS couramment utilisées pour créer un design responsive ?",
                    "commands": [
                        {
                            "label": [
                                "Pour créer un design responsive, plusieurs techniques CSS couramment utilisées incluent :",
                                "- [strong]Grilles CSS[/strong] : Les grilles CSS (CSS Grid Layout) permettent de créer des mises en page complexes et flexibles en définissant des lignes et des colonnes. Elles offrent un contrôle précis sur l'agencement des éléments, facilitant l'adaptation du contenu à différentes tailles d'écran.",
                                "- [strong]Flexbox[/strong] : Le modèle Flexbox (Flexible Box Layout) est idéal pour créer des mises en page unidimensionnelles. Il permet de distribuer l'espace entre les éléments d'une interface et d'aligner les éléments de manière efficace, même lorsque leur taille est inconnue ou dynamique.",
                                "- [strong]Media Queries[/strong] : Les media queries sont des règles CSS qui appliquent des styles spécifiques en fonction des caractéristiques du dispositif, telles que la largeur de l'écran, la résolution ou l'orientation. Cela permet d'adapter le design en fonction des différentes tailles d'écran, garantissant ainsi une expérience utilisateur optimale sur tous les appareils.",
                                "- [strong]Unités relatives[/strong] : L'utilisation d'unités relatives comme les pourcentages, les unités viewport (vw, vh) et les unités rem/em est recommandée pour garantir que les éléments s'ajustent proportionnellement à la taille de l'écran, offrant ainsi une meilleure adaptabilité.",
                                "En combinant ces techniques, les développeurs peuvent créer des sites web qui s'adaptent harmonieusement à une variété d'appareils, améliorant ainsi l'expérience utilisateur."
                            ]
                        }
                    ]
                },
                {
                    "title": "Comment Bootstrap facilite-il le responsive design ?",
                    "commands": [
                        {
                            "label": [
                                "Bootstrap facilite grandement la création de designs responsives grâce à plusieurs fonctionnalités clefs.",
                                "- Le [strong]Système de grille flexible[/strong] : Bootstrap fournit un puissant système de grille à 12 colonnes qui s'adapte automatiquement aux différentes tailles d'écran. Les développeurs peuvent facilement créer des mises en page complexes en utilisant des lignes et des colonnes, sans avoir à écrire de code CSS personnalisé.",
                                "- Les [strong]Classes utilitaires[/strong] : cette technologie inclut de nombreuses classes CSS utilitaires qui permettent d'ajouter rapidement des propriétés comme les marges, les paddings, les couleurs de fond, etc. Ces classes sont souvent conçues pour être responsives, avec des variantes pour différents breakpoints.",
                                "- Les [strong]Composants pré-stylés[/strong] : le framework fournit une bibliothèque de composants d'interface utilisateur comme les barres de navigation, les boutons, les formulaires, etc. Ces composants sont conçus pour être responsifs et s'adaptent automatiquement à la taille d'écran.",
                                "- Les [strong]Breakpoints prédéfinis[/strong] : Bootstrap définit des breakpoints standards (sm, md, lg, xl, xxl) qui correspondent à des tailles d'écran courantes. Les développeurs peuvent facilement cibler ces breakpoints avec des media queries pour ajuster la mise en page en fonction de la taille d'affichage.",
                                "En combinant ces fonctionnalités, Bootstrap permet aux développeurs de créer des designs responsives de manière efficace, en réduisant considérablement le temps et les efforts nécessaires."
                            ]
                        }
                    ]
                },
                {
                    "title": "Quels sont les défis courants lors de la mise en œuvre du responsive design ?",
                    "commands": [
                        {
                            "label": [
                                "Lors de la mise en œuvre du responsive design, plusieurs défis courants peuvent survenir.",
                                "- les [strong]Performances sur les appareils mobiles[/strong] : il faut en effet optimiser les images et minimiser le code est essentiel pour garantir une expérience fluide sur des appareils aux ressources limitées.",
                                "- La [strong]Compatibilité entre navigateurs[/strong] : les différences d'interprétation du CSS entre navigateurs peuvent entraîner des incohérences d'affichage, nécessitant des tests approfondis.",
                                "- La [strong]Complexité de la conception[/strong] : la création d'une mise en page qui s'adapte à diverses tailles d'écran peut être complexe, et nécessiter une réflexion sur la réorganisation des éléments.",
                                "- La [strong]Cohérence visuelle[/strong] : le maintient une harmonie dans les styles et les typographies sur différents appareils est important pour une expérience utilisateur agréable.",
                                "Surmonter ces défis est essentiel pour offrir une expérience utilisateur optimale sur tous les dispositifs."
                            ]
                        }
                    ]
                },
                {
                    "title": "Comment le responsive design impacte-t-il le référencement naturel (SEO) d'un site web ?",
                    "commands": [
                        {
                            "label": [
                                "Le [strong]responsive design[/strong] a un impact positif sur le SEO d'un site web pour plusieurs raisons :",
                                "- les sites optimisés sont privilégiés par Google ;",
                                "- cela fluidifie la navigation sur mobile diminuant ainsi le [strong]taux de rebond[/strong] ;",
                                "- les utilisateurs passant plus de temps sur un site qui s'adapte, cela renforce l'indicateur de qualité pris en compte par les algorithmes.",
                                "- un site responsive évite les problèmes de contenu dupliqué pénalisés par Google.",
                                "En résumé, le responsive design favorise une bonne expérience utilisateur sur mobile, ce qui se traduit par de meilleurs signaux de qualité pour le SEO."
                            ]
                        }
                    ]
                },
                {
                    "title": "Comment le responsive design peut-il améliorer l'accessibilité d'un site web ?",
                    "commands": [
                        {
                            "label": [
                                "Le responsive design améliore l'accessibilité d'un site web de plusieurs manières :",
                                "- La [strong]Lisibilité sur tous les appareils[/strong] garantit que le contenu reste lisible et navigable sur une variété d'appareils, y compris les mobiles.",
                                "- L'[strong]Adaptation de la mise en page[/strong] permet d'ajuster la mise en page pour répondre aux besoins des utilisateurs ayant des exigences spécifiques, comme ceux utilisant des technologies d'assistance.",
                                "En favorisant une expérience utilisateur cohérente et accessible, le responsive design contribue à rendre le web plus inclusif."
                            ]
                        }
                    ]
                },
                {
                    "title": "Quelles sont les meilleures pratiques pour concevoir des formulaires responsives ?",
                    "commands": [
                        {
                            "label": "Il est conseiller d'utiliser des champs de formulaire flexibles, l'étiquetage clair des champs, et la création de boutons de soumission adaptés. Il est également important de tester les formulaires sur différents appareils pour garantir une expérience utilisateur optimale."
                        }
                    ]
                },
                {
                    "title": "Comment gérer les images et les médias dans un design responsive ?",
                    "commands": [
                        {
                            "label": "Pour gérer les images dans un design responsive, utilisez des images adaptatives avec des attributs [strong]srcset[/strong] et [strong]sizes[/strong] pour charger des images appropriées en fonction de la taille de l'écran. L'utilisation de formats d'image modernes, comme [strong]WebP[/strong] ou [strong]AVIF[/strong], peut également améliorer les performances. Voici un exemple utilisant l'élément [strong]<picture>[/strong] avec différentes sources en fonction de la taille de l'écran et du format d'image supporté :"
                        },
                        {
                            "code": "<picture>\n  <source\n    media=\"(min-width: 1200px)\"\n    srcset=\"image-large.webp\"\n    type=\"image/webp\">\n  <source\n    media=\"(min-width: 1200px)\"\n    srcset=\"image-large.jpg\">\n  <source\n    media=\"(min-width: 800px)\"\n    srcset=\"image-medium.webp\"\n    type=\"image/webp\">\n  <source\n    media=\"(min-width: 800px)\"\n    srcset=\"image-medium.jpg\">\n  <source\n    srcset=\"image-small.webp\"\n    type=\"image/webp\">\n  <img\n    src=\"image-small.jpg\"\n    alt=\"Description de l'image\"\n    loading=\"lazy\">\n</picture>"
                        },
                        {
                            "label": "Cet exemple montre comment fournir différentes versions d'une image en fonction de la taille de l'écran (large, medium, small) et du support du format WebP. L'attribut 'loading=\"lazy\"' est ajouté pour le chargement différé de l'image."
                        }
                    ]
                },
                {
                    "title": "Comment gérer les polices et la typographie dans un design responsive ?",
                    "commands": [
                        {
                            "label": [
                                "Pour gérer la typographie dans un design responsive, utilisez des unités relatives comme 'em' ou 'rem' pour les tailles de police, et ajustez les styles avec des media queries.",
                                "Il est également important de choisir des polices lisibles et de s'assurer qu'elles s'affichent correctement sur tous les appareils."
                            ]
                        }
                    ]
                },
                {
                    "title": "Quel rôle jouent les images adaptatives dans le responsive design ?",
                    "commands": [
                        {
                            "label": [
                                "Les images adaptatives permettent de charger des images optimisées en fonction de la taille de l'écran, réduisant ainsi le temps de chargement et améliorant les performances.",
                                "Cela contribue également à une meilleure expérience utilisateur sur les appareils mobiles."
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "title": "La POO",
            "items": [
                {
                    "title": "Qu'est-ce que la POO ?",
                    "commands": [
                        {
                            "label": "La [strong]Programmation Orientée Objet (POO)[/strong] est un [strong]paradigme de programmation[/strong] qui organise le code en unités logiques réutilisables appelées objets. L'objectif principal de la POO est de créer du code modulaire, réutilisable et facile à maintenir. En organisant le code en objets, les développeurs peuvent mieux modéliser le monde réel et résoudre des problèmes complexes de manière structurée."
                        }
                    ]
                },
                {
                    "title": "Quels sont les quatre piliers fondamentaux de la POO ?",
                    "commands": [
                        {
                            "label": [
                                "Les quatre piliers fondamentaux de la Programmation Orientée Objet sont :",
                                "- L'[strong]Abstraction[/strong] consiste à se concentrer sur les informations essentielles et à ignorer les détails non pertinents. Elle permet de créer des classes qui représentent des concepts généraux.",
                                "- L'[strong]Encapsulation[/strong] est le processus qui consiste à regrouper les données et les méthodes dans une classe, cachant les détails d'implémentation. Cela permet de protéger les données et de garantir l'intégrité de l'objet.",
                                "- L'[strong]Héritage[/strong] est la capacité d'une classe (classe fille) à hériter des propriétés et des méthodes d'une autre classe (classe mère). Cela permet de créer une hiérarchie de classes et de réutiliser du code.",
                                "- Le [strong]Polymorphisme[/strong] est la capacité d'objets de différentes classes à répondre à un même message (méthode). Cela permet d'écrire du code générique qui peut fonctionner avec des objets de différents types."
                            ]
                        }
                    ]
                },
                {
                    "title": "Qu'est-ce que l'abstraction ?",
                    "commands": [
                        {
                            "label": "L'[strong]abstraction[/strong] consiste à se concentrer sur les informations essentielles et à ignorer les détails non pertinents : on parle de modèle. On l'utilise pour gérer la complexité et se concentrer sur l'essentiel. Voici des exemples simples d'abstraction dans différents langages :"
                        },
                        {
                            "label": "Exemple en JavaScript :",
                            "code": "class Voiture {\n  constructor(marque) {\n    this.marque = marque;\n  }\n\n  demarrer() {\n    console.log(`La ${this.marque} démarre.`);\n  }\n}\n\nconst maVoiture = new Voiture('Toyota');\nmaVoiture.demarrer(); // Affiche: La Toyota démarre."
                        },
                        {
                            "label": "Exemple en Java :",
                            "code": "public class Voiture {\n  private String marque;\n\n  public Voiture(String marque) {\n    this.marque = marque;\n  }\n\n  public void demarrer() {\n    System.out.println(\"La \" + marque + \" démarre.\");\n  }\n}\n\n// Dans une autre classe ou méthode main\nVoiture maVoiture = new Voiture(\"Honda\");\nmaVoiture.demarrer(); // Affiche: La Honda démarre."
                        },
                        {
                            "label": "Exemple en PHP :",
                            "code": "class Voiture {\n  private $marque;\n\n  public function __construct($marque) {\n    $this->marque = $marque;\n  }\n\n  public function demarrer() {\n    echo \"La {$this->marque} démarre.\";\n  }\n}\n\n$maVoiture = new Voiture('Renault');\n$maVoiture->demarrer(); // Affiche: La Renault démarre."
                        },
                        {
                            "label": "Exemple en Python :",
                            "code": "class Voiture:\n  def __init__(self, marque):\n    self.marque = marque\n\n  def demarrer(self):\n    print(f\"La {self.marque} démarre.\")\n\nma_voiture = Voiture('Peugeot')\nma_voiture.demarrer() # Affiche: La Peugeot démarre."
                        }
                    ]
                },
                {
                    "title": "Qu'est-ce que l'encapsulation ?",
                    "commands": [
                        {
                            "label": "L'[strong]encapsulation[/strong] est un principe de la POO qui consiste à regrouper les données (attributs) et les méthodes qui les manipulent au sein d'une même unité (la classe), tout en restreignant l'accès direct à ces données. On utilise généralement des attributs privés avec des méthodes publiques (getters et setters) pour y accéder et les modifier. Voici des exemples dans différents langages :"
                        },
                        {
                            "label": "Exemple en JavaScript :",
                            "code": "// Classe Personne\nclass Personne {\n  #nom; // Attribut privé (à partir d'ES2022)\n\n  // Constructeur\n  constructor(nom) {\n    this.#nom = nom;\n  }\n\n  // Getter pour obtenir le nom\n  getNom() {\n    return this.#nom;\n  }\n\n  // Setter pour modifier le nom\n  setNom(nouveauNom) {\n    if (nouveauNom.length > 0) {\n        this.#nom = nouveauNom;\n    }\n  }\n}\n\n// Utilisation de la classe\nconst personne = new Personne('Alice');\nconsole.log(personne.getNom()); // Affiche: Alice\npersonne.setNom('Bob');\nconsole.log(personne.getNom()); // Affiche: Bob"
                        },
                        {
                            "label": "Exemple en Java :",
                            "code": "// Classe Personne\npublic class Personne {\n  private String nom;\n\n  // Constructeur\n  public Personne(String nom) {\n    this.nom = nom;\n  }\n\n  // Getter pour obtenir le nom\n  public String getNom() {\n    return nom;\n  }\n\n  // Setter pour modifier le nom\n  public void setNom(String nouveauNom) {\n    if (nouveauNom != null && !nouveauNom.isEmpty()) {\n        this.nom = nouveauNom;\n    }\n  }\n}\n\n// Utilisation de la classe\nPersonne personne = new Personne(\"Alice\");\nSystem.out.println(personne.getNom()); // Affiche: Alice\npersonne.setNom(\"Bob\");\nSystem.out.println(personne.getNom()); // Affiche: Bob"
                        },
                        {
                            "label": "Exemple en PHP :",
                            "code": "// Classe Personne\nclass Personne {\n  private $nom;\n\n  // Constructeur\n  public function __construct($nom) {\n    $this->nom = $nom;\n  }\n\n  // Getter pour obtenir le nom\n  public function getNom() {\n    return $this->nom;\n  }\n\n  // Setter pour modifier le nom\n  public function setNom($nouveauNom) {\n    if (!empty($nouveauNom)) {\n        $this->nom = $nouveauNom;\n    }\n  }\n}\n\n// Utilisation de la classe\n$personne = new Personne(\"Alice\");\necho $personne->getNom() . \"\\n\"; // Affiche: Alice\n$personne->setNom(\"Bob\");\necho $personne->getNom() . \"\\n\"; // Affiche: Bob"
                        },
                        {
                            "label": "Exemple en Python :",
                            "code": "// Classe Personne\nclass Personne:\n  # Constructeur\n  def __init__(self, nom):\n    self.__nom = nom  # Attribut privé\n\n  # Getter pour obtenir le nom\n  def get_nom(self):\n    return self.__nom\n\n  # Setter pour modifier le nom\n  def set_nom(self, nouveau_nom):\n    if nouveau_nom:\n        self.__nom = nouveau_nom\n\n# Utilisation de la classe\npersonne = Personne(\"Alice\")\nprint(personne.get_nom())  # Affiche: Alice\npersonne.set_nom(\"Bob\")\nprint(personne.get_nom())  # Affiche: Bob"
                        }
                    ]
                },
                {
                    "title": "Qu'est-ce que l'héritage ?",
                    "commands": [
                        {
                            "label": "L'[strong]héritage[/strong] permet à une classe d'hériter des propriétés et méthodes d'une autre classe. Il favorise la réutilisation du code et permet de créer des hiérarchies logiques. Cependant, il peut créer des dépendances fortes entre les classes s'il est mal utilisé."
                        },
                        {
                            "label": "Exemple en JavaScript :",
                            "code": "// Classe de base Animal\nclass Animal {\n  manger() {\n    console.log(\"L'animal mange.\");\n  }\n}\n\n// Classe dérivée Chien\nclass Chien extends Animal {\n  aboyer() {\n    console.log(\"Le chien aboie.\");\n  }\n}\n\n// Utilisation\nconst monChien = new Chien();\nmonChien.manger(); // Affiche: L'animal mange.\nmonChien.aboyer(); // Affiche: Le chien aboie."
                        },
                        {
                            "label": "Exemple en Java :",
                            "code": "// Classe de base Animal\nclass Animal {\n  void manger() {\n    System.out.println(\"L'animal mange.\");\n  }\n}\n\n// Classe dérivée Chien\nclass Chien extends Animal {\n  void aboyer() {\n    System.out.println(\"Le chien aboie.\");\n  }\n}\n\n// Classe principale\npublic class ExempleHéritage {\n  public static void main(String[] args) {\n    Chien monChien = new Chien();\n    monChien.manger(); // Affiche: L'animal mange.\n    monChien.aboyer(); // Affiche: Le chien aboie.\n  }\n}"
                        },
                        {
                            "label": "Exemple en PHP :",
                            "code": "// Classe de base Animal\nclass Animal {\n  public function manger() {\n    echo \"L'animal mange.\\n\";\n  }\n}\n\n// Classe dérivée Chien\nclass Chien extends Animal {\n  public function aboyer() {\n    echo \"Le chien aboie.\\n\";\n  }\n}\n\n// Utilisation\n$monChien = new Chien();\n$monChien->manger(); // Affiche: L'animal mange.\n$monChien->aboyer(); // Affiche: Le chien aboie."
                        },
                        {
                            "label": "Exemple en Python :",
                            "code": "# Classe de base Animal\nclass Animal:\n  def manger(self):\n    print(\"L'animal mange.\")\n\n# Classe dérivée Chien\nclass Chien(Animal):\n  def aboyer(self):\n    print(\"Le chien aboie.\")\n\n# Utilisation\nmon_chien = Chien()\nmon_chien.manger()  # Affiche: L'animal mange.\nmon_chien.aboyer()  # Affiche: Le chien aboie."
                        }
                    ]
                },
                {
                    "title": "Qu'est-ce que le polymorphisme ?",
                    "commands": [
                        {
                            "label": [
                                "Le [strong]polymorphisme[/strong] permet à des objets de classes différentes d'être traités comme des objets d'une classe commune. Il permet une grande flexibilité et extensibilité du code, mais peut rendre le code plus difficile à suivre s'il est mal utilisé. Voici des exemples dans différents langages illustrant le polymorphisme avec des quadrilatères :"
                            ]
                        },
                        {
                            "label": "Exemple en JavaScript :",
                            "code": "// Classe de base Forme\nclass Forme {\n  dessiner() {\n    console.log(\"Forme\");\n  }\n}\n\n// Classe Rectangle\nclass Rectangle extends Forme {\n  dessiner() {\n    console.log(\"Rectangle\");\n  }\n}\n\n// Classe Carre\nclass Carre extends Forme {\n  dessiner() {\n    console.log(\"Carré\");\n  }\n}\n\n// Polymorphisme\nfunction dessinerForme(forme) {\n  forme.dessiner();\n}\n\n// Utilisation\nconst rectangle = new Rectangle();\nconst carre = new Carre();\n\ndessinerForme(rectangle);  // Affiche: Rectangle\ndessinerForme(carre); // Affiche: Carré"
                        },
                        {
                            "label": "Exemple en Java :",
                            "code": "// Classe de base Forme\nabstract class Forme {\n  abstract void dessiner();\n}\n\n// Classe Rectangle\nclass Rectangle extends Forme {\n  public void dessiner() {\n    System.out.println(\"Rectangle\");\n  }\n}\n\n// Classe Carre\nclass Carre extends Forme {\n  public void dessiner() {\n    System.out.println(\"Carré\");\n  }\n}\n\n// Classe principale\npublic class ExemplePolymorphisme {\n  // Polymorphisme\n  public static void dessinerForme(Forme forme) {\n    forme.dessiner();\n  }\n\n  public static void main(String[] args) {\n    Forme rectangle = new Rectangle();\n    Forme carre = new Carre();\n\n    dessinerForme(rectangle);  // Affiche: Rectangle\n    dessinerForme(carre); // Affiche: Carré\n  }\n}"
                        },
                        {
                            "label": "Exemple en PHP :",
                            "code": "// Classe de base Forme\nclass Forme {\n  public function dessiner() {\n    echo \"Forme\\n\"  }\n;\n}\n\n// Classe Rectangle\nclass Rectangle extends Forme {\n  public function dessiner() {\n    echo \"Rectangle\\n\";\n  }\n}\n\n// Classe Carre\nclass Carre extends Forme {\n  public function dessiner() {\n    echo \"Carré\\n\";\n  }\n}\n\n// Polymorphisme\nfunction dessinerForme(Forme $forme) {\n  $forme->dessiner();\n}\n\n// Utilisation\n$rectangle = new Rectangle();\n$carre = new Carre();\n\ndessinerForme($rectangle);  // Affiche: Rectangle\ndessinerForme($carre); // Affiche: Carré"
                        },
                        {
                            "label": "Exemple en Python :",
                            "code": "from abc import ABC, abstractmethod\n\n# Classe de base Forme\nclass Forme(ABC):\n  @abstractmethod\n  def dessiner(self):\n    pass\n\n# Classe Rectangle\nclass Rectangle(Forme):\n  def dessiner(self):\n    print(\"Rectangle\")\n\n# Classe Carre\nclass Carre(Forme):\n  def dessiner(self):\n    print(\"Carré\")\n\n# Polymorphisme\ndef dessiner_forme(forme):\n  forme.dessiner()\n\n# Utilisation\nrectangle = Rectangle()\ncarre = Carre()\n\ndessiner_forme(rectangle)  # Affiche: Rectangle\ndessiner_forme(carre) # Affiche: Carré"
                        }
                    ]
                },
                {
                    "title": "Quelle est la différence entre une classe et un objet ?",
                    "commands": [
                        {
                            "label": "Une [strong]classe[/strong] est un modèle ou un plan pour créer des objets, tandis qu'un [strong]objet[/strong] est une instance concrète de cette classe. Par exemple, une 'Voiture' est une classe, tandis que 'maVoitureRouge' est un objet spécifique créé à partir de cette classe."
                        }
                    ]
                },
                {
                    "title": "Qu'est-ce qu'une méthode abstraite ?",
                    "commands": [
                        {
                            "label": "Une [strong]méthode abstraite[/strong] est une méthode déclarée sans implémentation dans une classe abstraite. Les classes dérivées doivent fournir une implémentation pour ces méthodes. Voici un exemple en Java",
                            "code": "abstract class Animal {\n  abstract void faireDuBruit();\n}\n\nclass Chien extends Animal {\n  void faireDuBruit() {\n    System.out.println(\"Woof!\");\n  }\n}"
                        }
                    ]
                },
                {
                    "title": "Qu'est-ce qu'une interface en POO ?",
                    "commands": [
                        {
                            "label": "Une [strong]interface[/strong] en POO est un contrat qui spécifie un ensemble de méthodes qu'une classe doit implémenter. Voici un exemple en Java.",
                            "code": "interface Nageable {\n  void nager();\n}\n\nclass Poisson implements Nageable {\n  public void nager() {\n    System.out.println(\"Le poisson nage.\");\n  }\n}"
                        }
                    ]
                },
                {
                    "title": "Quelle est la différence entre une classe abstraite et une interface ?",
                    "commands": [
                        {
                            "label": [
                                "Les principales différences sont :",
                                "- Une classe abstraite peut avoir des méthodes concrètes et abstraites, une interface n'a que des méthodes abstraites sous la forme de signature.",
                                "- Une classe peut hériter d'une seule classe abstraite, mais peut implémenter plusieurs interfaces.",
                                "- Les classes abstraites peuvent avoir des constructeurs, pas les interfaces.",
                                "- Les classes abstraites peuvent avoir des attributs d'instance, les interfaces ne peuvent avoir que des constantes."
                            ]
                        }
                    ]
                },
                {
                    "title": "Quelle est la différence entre une méthode de classe et une méthode d'instance ?",
                    "commands": [
                        {
                            "label": [
                                "Une [strong]méthode de classe[/strong] (statique) appartient à la classe et peut être appelée sans instance.",
                                "Une [strong]méthode d'instance[/strong] nécessite une instance pour être appelée.",
                                "Voici des exemples :"
                            ]
                        },
                        {
                            "label": "Exemple en JavaScript :",
                            "code": "// Classe Exemple\nclass Exemple {\n  static methodeDeClasse() {\n    console.log(\"Méthode de classe.\");\n  }\n\n  methodeDInstance() {\n    console.log(\"Méthode d'instance.\");\n  }\n}\n\n// Affiche: Méthode de classe.\n Exemple.methodeDeClasse();\n\n// Affiche: Méthode d'instance.\nconst ex = new Exemple();\nex.methodeDInstance();"
                        },
                        {
                            "label": "Exemple en Java :",
                            "code": "// Classe Exemple\nclass Exemple {\n  static void methodeDeClasse() {\n    System.out.println(\"Méthode de classe.\");\n  }\n\n  void methodeDInstance() {\n    System.out.println(\"Méthode d'instance.\");\n  }\n}\n\npublic class Main {\n  public static void main(String[] args) {\n    // Affiche: Méthode de classe.\n    Exemple.methodeDeClasse();\n\n    // Affiche: Méthode d'instance.\n    Exemple ex = new Exemple();\n    ex.methodeDInstance();\n  }\n}"
                        },
                        {
                            "label": "Exemple en PHP :",
                            "code": "// Classe Exemple\nclass Exemple {\n  public static function methodeDeClasse() {\n    echo \"Méthode de classe.\\n\";\n  }\n\n  public function methodeDInstance() {\n    echo \"Méthode d'instance.\\n\";\n  }\n}\n\n// Affiche: Méthode de classe.\nExemple::methodeDeClasse();\n\n// Affiche: Méthode d'instance.\n$ex = new Exemple();\n$ex->methodeDInstance();"
                        },
                        {
                            "label": "Exemple en Python :",
                            "code": "class Exemple:\n  @classmethod\n  def methodeDeClasse(cls):\n    print(\"Méthode de classe.\")\n\n  def methodeDInstance(self):\n    print(\"Méthode d'instance.\")\n\n# Affiche: Méthode de classe.\nExemple.methodeDeClasse()\n\n# Affiche: Méthode d'instance.\nex = Exemple()\nex.methodeDInstance()"
                        }
                    ]
                },
                {
                    "title": "Qu'est-ce que le \"getter\" et le \"setter\" en POO ?",
                    "commands": [
                        {
                            "label": "Les [strong]getters[/strong] et [strong]setters[/strong] sont des méthodes utilisées pour accéder et modifier les attributs privés d'une classe, respectant ainsi le principe d'encapsulation."
                        },
                        {
                            "label": "Exemple en JavaScript :",
                            "code": "// JavaScript\nclass Personne {\n  constructor(nom) {\n    this._nom = nom;\n  }\n\n  get nom() {\n    return this._nom;\n  }\n\n  set nom(nouveauNom) {\n    this._nom = nouveauNom;\n  }\n}"
                        },
                        {
                            "label": "Exemple en Java :",
                            "code": "public class Personne {\n  private String nom;\n\n  public String getNom() {\n    return nom;\n  }\n\n  public void setNom(String nom) {\n    this.nom = nom;\n  }\n}"
                        },
                        {
                            "label": "Exemple en PHP :",
                            "code": "class Personne {\n  private $nom;\n\n  public function getNom() {\n    return $this->nom;\n  }\n\n  public function setNom($nom) {\n    $this->nom = $nom;\n  }\n}"
                        },
                        {
                            "label": "Exemple en Python :",
                            "code": "class Personne:\n  def __init__(self, nom):\n    self._nom = nom\n\n  @property\n  def nom(self):\n    return self._nom\n\n  @nom.setter\n  def nom(self, nouveau_nom):\n    self._nom = nouveau_nom"
                        }
                    ]
                }
            ]
        },
        {
            "title": "Les bases de données",
            "items": [
                {
                    "title": "Qu'est-ce qu'une base de données ?",
                    "commands": [
                        {
                            "label": "Une [strong]base de données[/strong] est un système organisé qui permet de stocker, gérer et récupérer des données de manière efficace. Elle est conçue pour faciliter l'accès et la manipulation des informations, garantissant ainsi leur intégrité et leur sécurité. Les bases de données peuvent être classées en plusieurs types, notamment les bases de données relationnelles, qui utilisent des tables pour structurer les données, et les bases de données NoSQL, qui offrent une flexibilité accrue pour le stockage de données non structurées. "
                        }
                    ]
                },
                {
                    "title": "Qu'est-ce qu'un SGBD ?",
                    "commands": [
                        {
                            "label": [
                                "Un [strong]Système de Gestion de Base de Données (SGBD)[/strong] est un ensemble de logiciels qui permet de créer, gérer et manipuler des bases de données. Il fournit des outils essentiels pour stocker, récupérer, modifier et supprimer des données, facilitant ainsi l'accès aux informations pour les utilisateurs et les applications.",
                                "Les SGBD garantissent l'intégrité et la sécurité des données en appliquant des règles de validation et en contrôlant les accès. Ils sont utilisés dans divers domaines, allant des applications web aux systèmes d'entreprise, et sont essentiels pour assurer une gestion efficace des informations.",
                                "Parmi les exemples de SGBD populaires, on trouve :",
                                "- [strong]MySQL[/strong] est un SGBD relationnel open source, largement utilisé pour les applications web.",
                                "- [strong]PostgreSQL[/strong] est un SGBD relationnel open source qui supporte des fonctionnalités avancées et est connu pour sa robustesse.",
                                "- [strong]Microsoft SQL Server[/strong] est un SGBD commercial qui offre des outils puissants pour la gestion de bases de données dans les environnements d'entreprise.",
                                "- [strong]MongoDB[/strong] est un SGBD NoSQL qui permet de stocker des données sous forme de documents JSON, offrant une grande flexibilité pour les applications modernes."
                            ]
                        }
                    ]
                },
                {
                    "title": "Quelles sont les principales fonctionnalités d'un SGBD ?",
                    "commands": [
                        {
                            "label": [
                                "Un [strong]Système de Gestion de Base de Données (SGBD)[/strong] fournit au moins cinq types de fonctionnalités.",
                                "- [strong]Gestion des données[/strong] : il permet en cela de structurer, organiser et stocker les données de manière efficace, facilitant leur accès et leur manipulation.",
                                "- [strong]Manipulation des données (CRUD)[/strong] : il comprend les opérations du CRUD, c'est-à-dire de création (Create), lecture (Read), mise à jour (Update) et suppression (Delete) des données, essentielles pour la gestion dynamique des informations.",
                                "- [strong]Sécurité des données[/strong] : il assure ainsi la protection des informations sensibles en contrôlant l'accès aux données et en appliquant des règles de sécurité pour prévenir les accès non autorisés.",
                                "- [strong]Gestion des transactions[/strong] : il permet d'exécuter des opérations de manière atomique, garantissant que les transactions sont complètes ou annulées en cas d'erreur, ce qui préserve l'intégrité des données.",
                                "- [strong]Création de rapports[/strong] : il offre enfin des outils pour générer des rapports et des analyses basées sur les données, facilitant la prise de décision et le suivi des performances."
                            ]
                        }
                    ]
                },
                {
                    "title": "Qu'est-ce que le SQL ?",
                    "commands": [
                        {
                            "label": [
                                "Le [strong]Structured Query Language (SQL)[/strong] est un langage standard utilisé pour interagir avec les bases de données relationnelles. Il permet aux utilisateurs de créer, lire, mettre à jour et supprimer des données, un ensemble d'opérations couramment désigné sous le terme [strong]CRUD[/strong] (Create, Read, Update, Delete).",
                                "SQL offre une syntaxe claire et structurée, facilitant l'écriture de requêtes pour extraire des informations spécifiques, modifier des enregistrements ou gérer la structure des bases de données. Il comprend également des fonctionnalités avancées telles que la gestion des transactions, les jointures entre tables, et les fonctions d'agrégation, permettant ainsi des analyses complexes et des manipulations de données efficaces.",
                                "En raison de sa puissance et de sa flexibilité, SQL est devenu le langage de référence pour la gestion des données dans de nombreuses applications, allant des systèmes de gestion d'entreprise aux plateformes de données analytiques."
                            ]
                        }
                    ]
                },
                {
                    "title": "Qu'est-ce qu'une table dans une base de données ?",
                    "commands": [
                        {
                            "label": [
                                "Une [strong]table[/strong] est une [strong]collection de données[/strong] organisées en lignes et en colonnes, qui constitue la structure fondamentale d'une base de données relationnelle. Chaque ligne de la table représente un [strong]enregistrement[/strong], correspondant à une instance unique d'un objet ou d'une entité, tandis que chaque colonne représente un [strong]attribut[/strong] de cet enregistrement, définissant les caractéristiques de l'objet.",
                                "Les tables sont liées entre elles par des relations, ce qui permet de structurer les données de manière logique et de faciliter les opérations de recherche et de manipulation. Par exemple, une table 'Clients' peut contenir des informations telles que le nom, l'adresse et le numéro de téléphone, tandis qu'une table 'Commandes' peut enregistrer les achats effectués par ces clients. Cette organisation permet d'effectuer des requêtes complexes et d'obtenir des informations précises à partir de plusieurs tables."
                            ]
                        }
                    ]
                },
                {
                    "title": "Qu'est-ce qu'une requête SQL ?",
                    "commands": [
                        {
                            "label": [
                                "Une [strong]requête SQL[/strong] est une instruction utilisée pour interroger, manipuler ou gérer des données dans une base de données. Elle permet aux utilisateurs d'extraire des informations spécifiques, de modifier des enregistrements existants, d'ajouter de nouvelles données ou de supprimer des données non nécessaires.",
                                "Les requêtes SQL peuvent varier en complexité, allant des simples instructions de sélection, comme [strong]SELECT[/strong], qui récupèrent des données d'une ou plusieurs tables, à des requêtes plus complexes utilisant des jointures, des sous-requêtes et des fonctions d'agrégation. Par exemple, une requête peut être formulée pour obtenir la liste des clients ayant passé des commandes au cours du dernier mois, en combinant les tables 'Clients' et 'Commandes'. Grâce à sa flexibilité et sa puissance, SQL est un outil essentiel pour l'analyse et la gestion des données dans les systèmes de gestion de bases de données."
                            ]
                        }
                    ]
                },
                {
                    "title": "Quelles sont les principales clauses en SQL ?",
                    "commands": [
                        {
                            "label": "On utilise plusieurs [strong]clauses[/strong] en SQL. En voici quelques unes."
                        },
                        {
                            "label": "La clause [strong]SELECT[/strong] permet de sélectionner des enregistrements. Ci-dessous, on sélectionne toutes les colonnes de la table utilisateurs.",
                            "code": "SELECT * FROM utilisateurs;"
                        },
                        {
                            "label": "La clause [strong]INSERT[/strong] permet d'insérer des enregistrements. Ci-dessous, on insère un nouvel enregistrement dans la table utilisateurs",
                            "code": "INSERT INTO utilisateurs (nom, age)\nVALUES ('Alice', 30); "
                        },
                        {
                            "label": "La clause [strong]UPDATE[/strong] permet de mettre à jour des enregistrements. Ci-dessous, on met à jour l'âge de l'utilisateur 'Alice'",
                            "code": "UPDATE utilisateurs\nSET age = 31\nWHERE nom = 'Alice'; "
                        },
                        {
                            "label": "La clause [strong]DELETE[/strong] permet de supprimer des enregistrements. Ci-dessous, on supprime l'enregistrement de l'utilisateur 'Alice'",
                            "code": "DELETE FROM utilisateurs\nWHERE nom = 'Alice';"
                        },
                        {
                            "label": "La clause [strong]CREATE[/strong] permet de créer une table. Ci-dessous, on crée une nouvelle table utilisateurs",
                            "code": "CREATE TABLE utilisateurs (\n  id INT PRIMARY KEY, \n  nom VARCHAR(100), \n  age INT\n);"
                        },
                        {
                            "label": "La clause [strong]DROP[/strong] permet de supprimer une table. Ci-dessous, on supprime la table utilisateurs",
                            "code": "DROP TABLE utilisateurs;"
                        }
                    ]
                },
                {
                    "title": "Qu'est-ce qu'une clé primaire ?",
                    "commands": [
                        {
                            "label": [
                                "Une [strong]clé primaire[/strong] est un champ ou un ensemble de champs dans une table de base de données qui identifie de [strong]manière unique[/strong] chaque enregistrement. Elle garantit que chaque ligne de la table est distincte, empêchant ainsi la duplication des données.",
                                "La clé primaire joue un rôle essentiel dans la structuration des données et l'établissement de relations entre les tables. Par exemple, dans une table 'Clients', un champ comme 'ID_Client' pourrait être utilisé comme clé primaire pour identifier chaque client de manière unique. De plus, une clé primaire peut également être utilisée comme clé étrangère dans d'autres tables, permettant ainsi de créer des relations entre les données. En résumé, la clé primaire est essentielle pour maintenir l'intégrité des données et faciliter les opérations de recherche et de manipulation dans une base de données."
                            ]
                        }
                    ]
                },
                {
                    "title": "Qu'est-ce qu'une clé étrangère ?",
                    "commands": [
                        {
                            "label": [
                                "Une [strong]clé étrangère[/strong] est un champ dans une table qui fait référence à la [strong]clé primaire[/strong] d'une autre table, établissant ainsi une relation entre les deux tables. Cette relation permet de lier des données connexes et de maintenir l'intégrité référentielle au sein de la base de données.",
                                "Par exemple, dans une base de données de gestion de commandes, une table 'Commandes' peut contenir une clé étrangère appelée 'ID_Client' qui fait référence à la clé primaire 'ID_Client' dans la table 'Clients'. Cela permet d'associer chaque commande à un client spécifique. L'utilisation de clés étrangères permet non seulement d'organiser les données de manière logique, mais aussi de garantir que les relations entre les tables sont cohérentes, empêchant ainsi l'insertion de données orphelines qui ne correspondraient à aucun enregistrement dans la table référencée."
                            ]
                        }
                    ]
                },
                {
                    "title": "Qu'est-ce qu'une relation one-to-one ?",
                    "commands": [
                        {
                            "label": "Une [strong]relation one-to-one[/strong] (ou un-à-un) est une relation qui unit deux tables. Un enregistrement dans une table est alors relié à un seul enregistrement dans une autre table."
                        },
                        {
                            "label": "Exemple :",
                            "code": "Table Utilisateur :\n| id | nom    |\n|----|--------|\n| 1  | Alice  |\n| 2  | Bob    |\n\nTable Profil :\n| id | age | id_user |\n|----|-----|---------|\n| 1  | 30  | 1       |\n| 2  | 25  | 2       |"
                        }
                    ]
                },
                {
                    "title": "Qu'est-ce qu'une relation one-to-many ?",
                    "commands": [
                        {
                            "label": [
                                "Une [strong]relation one-to-many[/strong] (ou un-à-plusieurs) est une relation qui unit deux tables. Un enregistrement dans une table peut être relié à plusieurs enregistrements dans une autre table.",
                                "Il existe à l'inverse une [strong]relation many-to-one[/strong]. Plusieurs enregistrements dans une table sont reliés à un seul enregistrement dans une autre table."
                            ]
                        },
                        {
                            "label": "Exemple :",
                            "code": "Table Auteur :\n| id | prénom  | nom           |\n|----|---------|---------------|\n| 1  | Victor  | Hugo          |\n| 2  | Gustave | Flaubert      |\n\nTable Livre :\n| id | titre           | id_auteur |\n|----|-----------------|-----------|\n| 1  | Les Misérables  | 1         |\n| 2  | Ruy-Blas        | 1         |\n| 3  | Madame Bovary   | 2         |"
                        }
                    ]
                },
                {
                    "title": "Qu'est-ce qu'une relation many-to-many ?",
                    "commands": [
                        {
                            "label": [
                                "Une [strong]relation many-to-many[/strong] (ou plusieurs-à-plusieurs) est une relation qui unit deux tables. Un enregistrement dans une table peut être relié à plusieurs enregistrements dans une autre table, et vice versa.",
                                "Cela se traduit par une [strong]table d'association[/strong], où l'on insère pour chaque ligne, la référence à un enregistrement de chaque table."
                            ],
                            "code": "Table Étudiant :\n| id | nom    |\n|----|--------|\n| 1  | Alice  |\n| 2  | Bob    |\n\nTable Cours :\n| id | titre            |\n|----|------------------|\n| 1  | Mathématiques    |\n| 2  | Histoire         |\n\nTable Étudiant_Cours :\n| id_etudiant  | id_cours |\n|--------------|----------|\n| 1            | 1        |\n| 1            | 2        |\n| 2            | 1        |"
                        }
                    ]
                },
                {
                    "title": "Qu'est-ce qu'une table d'association ?",
                    "commands": [
                        {
                            "label": "La [strong]table d'association[/strong] est table utilisée dans le cadre d'une [strong]relation many-to-many[/strong]. Elle contient des clefs étrangères qui font référence aux clefs primaires des deux tables impliquées dans la relation. Dans l'exemple ci-dessus, la table Étudiant_Cours associe les étudiants aux cours qu'ils suivent. Voici un exemple :",
                            "code": "Table Étudiant :\n| id | nom    |\n|----|--------|\n| 1  | Alice  |\n| 2  | Bob    |\n\nTable Cours :\n| id | titre            |\n|----|------------------|\n| 1  | Mathématiques    |\n| 2  | Histoire         |\n\nTable Étudiant_Cours :\n| id_etudiant  | id_cours |\n|--------------|----------|\n| 1            | 1        |\n| 1            | 2        |\n| 2            | 1        |"
                        }
                    ]
                },
                {
                    "title": "Qu'est-ce qu'une jointure ?",
                    "commands": [
                        {
                            "label": [
                                "Une [strong]jointure[/strong] (JOIN en SQL) est une opération qui combine des enregistrements de deux ou plusieurs tables en fonction d'une condition liée à une clef. Voici les différents types de jointures et leur utilité :",
                                "- L'[strong]INNER JOIN[/strong] retourne les enregistrements lorsque la condition est vraie dans les deux tables. Utilisé pour obtenir uniquement les lignes correspondantes.",
                                "- Le [strong]LEFT JOIN[/strong] retourne tous les enregistrements de la table de gauche et les enregistrements correspondants de la table de droite. Si aucune correspondance, les résultats de la table de droite seront NULL.",
                                "- Le [strong]RIGHT JOIN[/strong] retourne tous les enregistrements de la table de droite et les enregistrements correspondants de la table de gauche. Si aucune correspondance, les résultats de la table de gauche seront NULL.",
                                "- Le [strong]FULL JOIN[/strong] retourne tous les enregistrements des deux tables, même s'il n'y a pas de correspondance. Les valeurs manquantes sont définies à NULL.",
                                "- Le [strong]CROSS JOIN[/strong] retourne le produit cartésien des deux tables, c'est-à-dire toutes les combinaisons possibles d'enregistrements."
                            ]
                        }
                    ]
                },
                {
                    "title": "Qu'est-ce que le CRUD dans une base de données ?",
                    "commands": [
                        {
                            "label": [
                                "Les opérations [strong]CRUD[/strong] représentent les quatre fonctions fondamentales pour la gestion des données dans une base de données. Ces opérations sont essentielles pour créer, lire, mettre à jour et supprimer des enregistrements, et elles sont réalisées à l'aide des clauses SQL suivantes :",
                                "- [strong]CREATE[/strong] est utilisée pour ajouter de nouveaux enregistrements dans une table. Par exemple, une requête SQL pour créer un nouvel utilisateur dans une table 'Utilisateurs'.",
                                "- [strong]SELECT[/strong] permet de lire ou d'extraire des données d'une ou plusieurs tables. Par exemple, une requête pour récupérer tous les enregistrements des clients d'une table 'Clients'.",
                                "- [strong]UPDATE[/strong] est utilisée pour modifier les enregistrements existants dans une table. Par exemple, une requête pour mettre à jour l'adresse d'un client dans la table 'Clients'.",
                                "- [strong]DELETE[/strong] permet de supprimer des enregistrements d'une table. Par exemple, une requête pour supprimer un utilisateur de la table 'Utilisateurs'.",
                                "Ces opérations CRUD sont fondamentales pour toute application utilisant une base de données, car elles permettent de gérer efficacement les données tout au long de leur cycle de vie."
                            ]
                        }
                    ]
                },
                {
                    "title": "Qu'est-ce que la normalisation ?",
                    "commands": [
                        {
                            "label": [
                                "La [strong]normalisation[/strong] est le processus de structuration d'une base de données afin de réduire la redondance des données et d'améliorer leur intégrité. Ce processus implique la division des données en tables distinctes et la définition de relations entre elles, ce qui permet d'éviter la duplication d'informations et de garantir que les données restent cohérentes.",
                                "La normalisation est généralement réalisée en suivant plusieurs [strong]formes normales[/strong], qui sont des règles définies pour organiser les données. Par exemple, la première forme normale (1NF) exige que chaque colonne d'une table contienne des valeurs atomiques, tandis que la deuxième forme normale (2NF) vise à éliminer les dépendances partielles entre les colonnes. En appliquant ces principes, les concepteurs de bases de données peuvent créer des structures qui facilitent la mise à jour, la recherche et la gestion des données tout en minimisant les anomalies."
                            ]
                        }
                    ]
                },
                {
                    "title": "Quelles sont les trois formes normales en conception de base de données ?",
                    "commands": [
                        {
                            "label": "Il existe trois formes normales."
                        },
                        {
                            "label": "Une table est en [strong]première forme normale[/strong] si tous les attributs contiennent des valeurs atomiques, c'est-à-dire que chaque colonne doit contenir une seule valeur et ne doit pas avoir de valeurs multivaluées ou composites.",
                            "code": "// Avant 1NF :\n| produit | fournisseur         |\n|---------|---------------------|\n| TV      | VIDEO SA, HITEK LTD |\n\n// Après 1NF :\n| produit | fournisseur |\n|---------|-------------|\n| TV      | VIDEO SA    |\n| TV      | HITEK LTD   |"
                        },
                        {
                            "label": "Une table est en [strong]deuxième forme normale[/strong] si elle est en première forme normale et si tous les attributs non clefs dépendent entièrement de la clef primaire. Cela signifie qu'aucun attribut ne doit dépendre d'une partie de la clef primaire.",
                            "code": "// Avant 2NF :\n| id  | nom   | cours         |\n|-----|-------|---------------|\n| 1   | Alice | Mathématiques |\n| 2   | Alice | Histoire      |\n| 3   | Bob   | Mathématiques |\n\n// Après 2NF :\n| id_etudiant | Nom   |\n|-------------|-------|\n| 1           | Alice |\n| 2           | Bob   |\n\n| id_cours   | Cours         |\n|------------|---------------|\n| 1          | Mathématiques |\n| 2          | Histoire      |"
                        },
                        {
                            "label": "Une table est en [strong]troisième forme normale[/strong] si elle est en deuxième forme normale  et si aucun attribut non clef ne dépend d'un autre attribut non clef. Cela signifie qu'il ne doit pas y avoir de dépendances transitives.",
                            "code": "// Avant 3NF :\n| id_etudiant | Nom   | id_cons | nom        |\n|-------------|-------|---------|------------|\n| 1           | Alice | 101     | M. Dupont  |\n| 2           | Bob   | 102     | M. Martin  |\n\n// Après 3NF :\n| id_etudiant | nom   | id_cons |\n|-------------|-------|---------|\n| 1           | Alice | 101     |\n| 2           | Bob   | 102     |\n\n| id_cons  | nom            |\n|----------|----------------|\n| 101      | M. Dupont      |\n| 102      | M. Martin      |"
                        }
                    ]
                },
                {
                    "title": "Quelles sont les principales contraintes d'intégrité à appliquer dans une base de données ?",
                    "commands": [
                        {
                            "label": [
                                "Il existe au moins trois [strong]contraintes d'intégrité[/strong] à appliquer dans une base de données.",
                                "- L'[strong]Intégrité de domaine[/strong]  garantit que les valeurs des attributs d'une colonne respectent un ensemble de règles prédéfini, comme le type de données, la plage de valeurs ou les formats. Par exemple, une colonne 'Âge' ne peut contenir que des valeurs numériques comprises entre 0 et 120.",
                                "- L'[strong]Intégrité d'entité[/strong]  assure que chaque enregistrement dans une table est unique et identifiable. Cela est généralement réalisé par l'utilisation d'une clé primaire, qui empêche la duplication des enregistrements au sein de la table.",
                                "- L'[strong]Intégrité référentielle[/strong]  maintient la cohérence entre les tables en s'assurant que les valeurs d'une clé étrangère dans une table correspondent à des valeurs existantes dans la clé primaire d'une autre table. Par exemple, si une table 'Commandes' contient une clé étrangère 'ID_Client', cette valeur doit correspondre à un 'ID_Client' valide dans la table 'Clients'.",
                                "Ces contraintes d'intégrité sont essentielles pour garantir la fiabilité et la cohérence des données dans une base de données, facilitant ainsi la gestion et l'analyse des informations."
                            ]
                        }
                    ]
                }
            ]
        }
    ]
}